[
{"campaignTitle": "Hannah's Heroes", "amountRaised": ["32,749"], "goal": "of $177k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["586"], "story": "Our daughter Hannah was born with 2 very rare diseases 1 called C.A.H\n  and the other called Spinal Muscular Atrophy, which works to rob her\n  of her ability to move, breath and, eventually, live. There is a drug\n  that can stop this disease. It has just approved it. But accessing it\n  costs $177,000, and the process of our drug plan won’t be ready for\n  another year. That’s a year that our little girl can’t afford to wait.\n  It would be a year of vulnerability and loss. But with your\n  help, we believe we can turn it into a year of miracles! Let me\n  tell you the rest of our story. Spinal Muscular Atrophy (SMA) has\n  become our daily life. It’s the genetic condition most likely to kill\n  children under six years of age, and our daughter has it. It’s a\n  progressive lower motor neuron disease, that is loosely paralleled to\n  adult ALS. But there are significant differences: most notably, SMA\n  never affects cognition, so our daughter is as bright and keen as any\n  other child her age. At 14 months, Hannah took her first 3 steps. She has never walked\n  since then. After those first steps, she lost any strength to walk,\n  then strength to pull up to stand, and then the strength to crawl. She\n  can barely get from a lying position to a sitting position. Hannah is\n  our mature little scholar! But she is completely dependant on us for\n  dressing, toileting, and getting her in her wheelchair.But those\n  things aren’t the worst. She is at an extreme risk of respiratory\n  failure. Every single simple cold/viral infection is a threat. At\n  least three times a year these infections strike hard enough to send\n  her to the hospital. As a parent, I weep and get nauseous just\n  thinking about this. I don’t want to think about what the next year\n  could hold for her. But the amazing thing is that it doesn’t have\n  to be that kind of year for our little girl. For over two decades\n  the gene responsible for SMA has been known but there has not been a\n  single available treatment. This past summer the first drug in history\n  to specifically treat SMA was approved ! It is called Spinraza\n  (Nusinersen). It can completely halt SMA in its path and even lead to\n  some GAIN in muscle strength! This drug truly is a miracle, and\n  we need our daughter on it as soon as possible. Though it’s\n  approved Spinraza won’t be available on our drug plans for another\n  year. It costs $177,000 to provide a year’s supply for Hannah 3 vials\n  . The manufacturer, Biogen, will sell it directly to families willing\n  to pay for it. This treatment WILL stop Hannah's respiratory deterioration, keep her\n  hands strong, and prevent future problems in her spine that would\n  require surgery.And we don’t even know what gains it might provide.\n  Instead of a year of atrophy it can become a year of miracles! But we\n  need your help. We do everything we can for our little girl but we\n  can’t do this alone. We need to raise $177,000. Please join us\n  on our journey and help to make this a year of miracles for Hannah", "url": ["https://fundrazr.com/HannahsHeroes"]},
{"campaignTitle": "Judy Gerdis Needs Costly Oral Chemo for Metastatic Breast Cancer", "amountRaised": ["3,181"], "goal": "of $9k goal", "currencyType": ["U.S. Dollar"], "endDate": "Aug 17, 2019", "numberContributors": ["35"], "story": "Hello, I am Tom and Judy Gerdis’ daughter, Trina Sutherland.\n     Some of you may be aware in April of this year my mother, Judy, was\n    told by her physicians that the breast cancer she fought hard to rid\n    her body of in 2008 through 2009 has returned and is attacking her\n    bones.  It is currently on a femur, in her tailbone,  shoulder,\n    neck, some parts of the spine, and her lower skull. We were excited\n    to learn through scans none of her organs have been affected. And we\n    want to keep it that way! She began a 10 day treatment of radiation two weeks ago. Now she is\n  waiting for her white blood cell count to recover so she may begin the\n  oral chemo treatment called Ibrance. Ibrance is a very costly\n  prescription. After insurance, it costs $2235.00 for a 21 day supply.\n  This prescription could possibly need to be administered for the next\n  year. I hope that we can all rally around my parents at this time so\n  they will not have to refinance their home in order to pay for this\n  lifesaving medicine. The cost of this one drug for a year is  close to\n  $30,000. The first month is covered and then we have 30 days to band\n  together before the bills hit for each new month’s prescription.  This\n  is not including her other medications and treatments. My mom is determined to win this battle once more. Tom and Judy are\n  confident the Lord is walking her through this journey  and the\n  Father’s amazing healing works will be demonstrated mightily. Thank you for your donations and prayers! Every little bit will help\n  my mom continue to fight the good fight. Please follow this page at\n  the bottom to keep up with updates. If Ibrance is discontinued,\n   whatever monies are raised will go to any other medical expenses my\n  parents may incur.   Blessings!", "url": ["https://fundrazr.com/f1VFVf"]},
{"campaignTitle": "Help Bre #keepmoving & maintain their independence with an Alinker walking bike!", "amountRaised": ["680"], "goal": "of $2.8k goal", "currencyType": ["Canadian Dollar"], "endDate": "Aug 6, 2019", "numberContributors": ["14"], "story": "Hey friends! Okay, so... I'm Bre. I'm 28 years old. I'm a lover of the\n    creative process and its many forms. I love trying new things\n    because I'm always up for a good challenge. However, I'm facing a\n    pretty big challenge of a different sort currently and would really\n    appreciate your help. I've lived with mobility issues since the age of\n    nine, because of multiple spinal issues, but mostly due to multiple\n    arachnoid cysts filled with fluid at the base of my spine which are\n    compressing my nerves. I've had surgery to drain it in 2001, and it\n    was stable for many years but recent MRIs have shown that it's\n    become filled with fluid once again. Medically, I'm figuring out\n    what my options are at the moment. In October of 2015, I woke up to feeling like there was a\n    piece of tape stuck to the bottom of my right foot. Since then I've\n    had multiple EMGs and MRIs done and am still left with not a lot of\n    answers or solutions. Due to a combination of my complicated case\n    and the scar tissue from my previous surgery, multiple neurosurgeons\n    have told me they're not comfortable attempting another... so I'm\n    left with a situation I need to find my own solution for. To get an idea of what I'm working with here, here's a picture\n    of a \"healthy\" spine vs my spine: If you feel like deciphering doctor language, here's my most\n    recent MRI report: ( Right-click on the pic > Open image in new tab to see it at full resolution) In summation: YIKES. What does this mean for me currently? Chronic Pain Numbness in my right foot makes it so I can't\n      feel the floor when I go to take a step, therefore, balance issues I haven't been able to walk without a cane\n      since 2016 I'm not able to walk very far, even with a\n      cane, so I've been essentially housebound for these last few\n      years, and boy, would I love not to be! I'm reliant on my brother and sister-in-law\n      for anything that requires me to leave the house. (They are the\n      best and don't mind, but I'd rather not have to!) So... What would the Alinker do for me? I'd be able to leave the house by myself(!!!) I could go get the mail! Grocery stores would once again be within my reach Unlike a wheelchair, I'd be able to rebuild\n      and maintain muscle tone in my legs Be able to have a conversation while walking\n      again instead of using all my energy focusing on trying not to fall I could enjoy my time at events, festivals,\n      family trips, etc. without feeling like I'm slowing everyone down Having a seat with me at all times would be a\n      dream come true I could explore the neighborhood and all its\n      cool historic sites I could take my nieces to the park I could walk the family dog I would be closer to being as cool as Selma Blair It really would give me so much freedom back,\n      open up my world again, and change my life. Thank you for your consideration and support ♥", "url": ["https://fundrazr.com/f1VtI8"]},
{"campaignTitle": "Help Rich Reach the Finish Line", "amountRaised": ["15,094"], "goal": "of $25k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["103"], "story": "**Please note: Medical bills have already depleted the $12,369 that\n  was raised over the past 4 years. ** In December of 2018, Rich learned that his Mantle Cell Lymphoma had\n  returned. It was hard to receive this news before Christmas, but love\n  for his family compelled him to continue his journey to being\n  cancer-free. In January he began a 3 month treatment of Venetoclax,\n  hoping the drug that worked so powerfully 2 years ago would bring him\n  into remission again. Instead, his disease spread exponentially. While still mid-course in the Venetoclax treatment, we\n  discovered that I, Rich’s sister, Janice, am a perfect 10/10 match for\n  an allogenic stem cell transplant! A matched sibling donor is\n  considered the “gold standard” for successful stem cell transplants.\n  The answer to our prayers came at the perfect time! An allogenic stem\n  cell transplant is the only potentially curative therapy for MCL On April 19, Rich began his 5th course of treatment in his 4 year\n  cancer marathon. We are beyond thankful that he is now in remission\n  and on track for an allogenic transplant at the end of June. After the\n  transplant, Rich is not expected to be discharged back to his home\n  until the end of September. Medical, lodging and transportation costs\n  will total approximately $12,000. Would you please help Rich reach the finish line with your prayers\n  and financial assistance?", "url": ["https://fundrazr.com/dta2e"]},
{"campaignTitle": "Helping Heidi with Cancer Treatments", "amountRaised": ["32,454"], "goal": "of $100k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["218"], "story": "For those that don’t know me I’m Heidi! For everyone else, Hi! And, if you haven’t heard already, please visit my website at https://peanutbutterandcancer.com/ for the full shebang. For those of you that may not be able to visit the website... Here’s the skinny. I have brain cancer. I know what you’re feeling, shock, me too\n    when I first found out. It started when I was in North Carolina visiting my mom who was\n    having a benign brain tumor removed on October 18th. (She’s\n    recovering great.) While there, I began having some difficulty\n    reading, super aggressive vomiting, and ultimately a raging\n    headache. This lasted for a couple of days. My Nanny fortuitously\n    took me to the ER in our hometown to, at the very least, get some\n    fluids. During that visit, the docs did a CT scan which showed\n    evidence of pressure on my brain and the team recommended further\n    testing. So I flew back to Denver, CO on October 23. Noah (my\n    husband) and I went to Porter ER for follow up. An MRI revealed a\n    mass in my brain and they suggested immediate surgery. On 10/25 I\n    underwent a successful surgery to remove the visible portions of the\n    25mm mass and the tissue was sent out for testing. I was released\n    from the hospital on 10/28. On November 1st, I found\n    out I have the deadliest of all 120 types of brain tumors, Stage 4\n    Glioblastoma (GBM). And... about 3 weeks ago we received some exciting news.  I tested\n  positive for cytomegalovirus (CMV).  Which means the CVM is\n    found in 60% of all GBMs.  It's also found in the stem cells of all\n    GBMs.  This gives us reason to think the cause of the cancer could\n    be from a virus. Which we are currently treating with antiviral\n    medications. So, in a world of medicine that's not quite sure what\n    to do with GBMs, this gives us a place to start. So, we got some fighting to do, huh? Here’s what treatment looks like. First I radically changed my diet (bye bye sugar and peanut butter) Then we started taking every supplement under the sun that is\n    rumored to have anti-cancer properties. After consulting our naturopathic oncologist and nutritionist,\n    we've narrowed down what supplements work for me.  Luckily, I've\n    been able to take less pills. Yay! We've done the radiation and the first round of chemo. I'll\n    still be doing small doses of chemo for the next 6 months. I’ve also been doing a number of alternative and spiritual\n    treatments: sound bath, reiki, acupuncture Soon I’ll be starting Optune. (This is the part where I shave my\n  head). You can check it out here if you want more info ... https://www.optune.com/ This is what I'll look like with the Optune on What I need from you. Send positive vibes. If you believe in Quantum Physics, you know\n    energy can heal. Forward any contacts or resources you may have surrounding\n    successful GBM treatments. Consider a monetary donation. Unfortunately, stupid cancer isn't\n    cheap. GBM is like a needy, expensive house guest that doesn't know\n    when to leave. If you feel compelled to donate, we appreciate your contribution.", "url": ["https://fundrazr.com/pbandcancer"]},
{"campaignTitle": "Opal needs our help", "amountRaised": ["1,650"], "goal": "of $20k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jun 23, 2019", "numberContributors": ["20"], "story": "Hello, family and friends. This is Sonia and my mom Opal needs our\n  help. She has asked me to help her raise money as her medical expenses\n  and medication expenses have wiped us out.  As most of you know she is\n  fighting cancer and the financial burden is real. My sweet mom is 79\n  years young and has been through so much. On top of all this , she has\n  lost her home. She sold her household items trying to hold on to her\n  house and pay for medical bills, but it wasn't enough to keep the bank\n  away. She's asked me to help her with her mounting medical expenses. \n  Please, help ease our financial pressure, so she can concentrate on\n  herself and getting well. Thank you and God bless us all.", "url": ["https://fundrazr.com/51VZgc"]},
{"campaignTitle": "British Gut", "amountRaised": ["690,181"], "goal": "", "currencyType": [], "endDate": "", "numberContributors": [], "story": "This is a unique open collaboration between the TwinsUK team at King's College London and The American Gut Project (AGP) / The Microsetta Initiative to expand the study of the bacterial diversity to\n    participants in Europe. If you are a participant living outside Europe and would like\n    to participate, please refer to our American Gut Fundrazr page . Many\n  people don't realize that the bacteria that live inside us play an\n  incredibly important role in our health. There are so many of them:\n  They make up 50 percent of the cells in our body and their most\n  important jobs include manufacturing vitamins for us and breaking down\n  and digesting our food. The trillions of bacteria in our gut weigh\n  nearly 2 kg (over 4lbs). This community of bacteria can be thought of\n  as an extra 'organ' which we call our \"microbiome\".  Recent\n  research has discovered that small changes in this finely balanced\n  community can affect our immune system, metabolism, body weight, mood\n  and may even cause diseases such as Crohn's disease, irritable bowel\n  syndrome, cancer, autoimmune disease, diabetes and heart disease. This is the first project of its kind in Europe, as an extension\n    of the American Gut Project & The Microsetta Initiative, based\n    at the University of California San Diego.  We have collaborated\n    with TwinsUK at King’s College London so that those living in Europe\n    can participate, and with your help, we will be able to discover\n    more about the crucial relationship between our health and our\n    microbiome, and on a personal level, you will be able to discover\n    the bacterial profile of your own gut. With your help, we hope to be\n    able to answer questions such as 'How much does our choice of\n    lifestyle and diet influence our microbiome, and can we alter our\n    microbiome to make us healthier?' We are discovering that each person is very different and has\n    their own unique microbiome. More research is needed to work out\n    what constitutes a 'healthy' microbiome, and which combinations of\n    bacteria are beneficial and which ones should be avoided. In order\n    to do this ambitious and much-needed project, we urgently need a\n    large scale collection of human samples. Over ten thousand people\n    have already signed up in America already through the American Gut\n    Project-- but we need many more from Europe. The project mainly focuses on the gut as this is our main\n    'microbial home', however, the study will also look at areas like\n    the oral and skin, as these areas of the body may be influenced by\n    the microbiome. Joining is simple! Select the kit you would like from the list\n    of options on the left-hand side by clicking “Claim this perk” found\n    on the right side (if you would like to receive a specific number of\n    kits that isn’t listed as a perk, email us at info@britishgut.org ). You will receive your kit within 3 weeks after payment. Shipping within the U.K. first class should be around £2.90, but\n    we recommend taking the sample to the post office to get the proper\n    postage. Getting the postage right on the first try is important\n    since samples that spend a long time in transit will likely not\n    produce the highest quality results. After you have returned your\n    sample to us, we will then sent it to the Knight Lab at the\n    University of California San Diego to be processed and analyzed. We estimate that the whole process will take about 4-5\n  months. We typically bulk ship samples back to the Knight\n  Lab every 1-2 months on dry ice to reduce shipping costs. Once your\n  sample is arrives at the Knight Lab (you'll get a notification when\n  they have received your sample), it takes approximately 3 months to\n  return results. Each kit contains a sample collection device (or multiple if you\n    ordered more than one), an instruction packet on how to sample, and\n    return envelope(s) to send your sample tube(s) back. Once we provide you with your results, you will receive data\n    visualization of how your results compare to other people who are\n    within the same diet and lifestyle group as you (having different\n    results from them does not necessarily mean anything bad, it can\n    just be that you have different lifestyles that make bacterial\n    profile is different).   In addition, you will be provided with a\n    list of the major groups of bacteria in your sample and their\n    relative abundances (based at the genus level). These results are not actionable,\n      and we do not provide any personalized interpretation . It will take longer than the expected 4-5 months to receive\n      results if you are submitting one of the following sample types: Oral or skin samples. A desktop computer or laptop is recommended to register and log your sample into our\n      participant portal website, as our participant website has\n      compatibility issues on mobile devices and tablets.  The best\n      browser to use when you register your kit is Google Chrome. Note your de-identified information will be part of a\n      research study and will be made available in a publicly available\n      research database. That is, any personal information that might\n      easily identify who you are will be removed before being placed in\n      the public database. If you decide that you no longer wish to continue in this\n      study, please send a request to the British Gut Project help\n      account ( info@britishgut.org ) to inform us of your intent to withdraw. You may request a\n      refund within 50 days of your original payment if you have not yet used your kit. Please note that the Fundrazr transaction fee will be\n        deducted from your refund. The consent forms are maintained on the participant website;\n      details are included in your kit. To sign the consent form, you\n      must agree to use an electronic format for your signature in\n      accordance with the United States' eSIGN Act and California's UETA\n      Act. You have the right to obtain the electronic record in a\n      non-electronic form. The results you receive from submitting a sample are not\n      meant to act as medical or health diagnoses . We will not be able to provide any clinical or medical\n      information/recommendations from your results. We look forward to working together on this new and exciting\n      project! If you have any questions, email us at info@britishgut.org .", "url": ["https://fundrazr.com/britishgut"]},
{"campaignTitle": "Miles Turns Two", "amountRaised": ["5,460"], "goal": "of $5k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jun 16, 2019", "numberContributors": ["48"], "story": "Miles was born at 9:35PM on June 8, 2017 at Advocate Lutheran General\n  Hospital, and it was quickly discovered that something wasn't quite\n  right. Miles was gasping for air and showing signs of seizures, and he\n  was almost immediately whisked away to the NICU for what would be his\n  home for months to come. After four, long days of tests, x-rays, and\n  more pokes than one newborn should ever have to endure, it was\n  discovered that Miles's ALP levels were \"immeasurable\" and\n  many of his bones were so under-mineralized, that they didn't even\n  show up on x-ray. While we didn't have genetic confirmation at this\n  point (that would come a few weeks later), Miles was diagnosed with\n  Infantile Hypophosphatasia - or HPP for short. With his essentially\n  nonexistent ALP, Miles is unable to mineralize bones properly. His\n  body also struggles with breaking down B6, which cause him to suffer\n  from B6 responsive seizures. Thankfully for Miles and the rest of us,\n  there is an enzyme replacement therapy that was recently approved by\n  the FDA. Miles received his first injection on June 23. It took about two months to start to see some development in Miles's\n  bones. His skull that was referred to as \"bone buds\" when he\n  was born was finally starting to mineralize. His ribs that looked like\n  toothpicks on the first x-ray were showing some strength. We had no\n  idea for these first couple of months if the enzyme replacement\n  therapy would work. And these x-rays were the first real sign of hope\n  because by the end of July, Miles had tired himself out from his\n  short, shallow breathing and found himself intubated. After much\n  discussion with his doctors, Miles had surgery to get his trach and\n  g-tube on August 9. Now you'd think that with a ventilator helping him breathe and the\n  enzyme replacement therapy helping him mineralize his bones, we would\n  have started to see marked improvement in Miles. But that wasn't the\n  case. Miles continued to struggle. Growing bones is apparently quite\n  painful (I mean even the great Harry Potter thought so). After some\n  advocating by his wonderful nurses, Miles was given a morphine drip\n  for the pain. He was also on a number of sedative drugs. It took until\n  November, at over 5 months old, for Miles to be weaned off of his IV\n  drips and have his central line removed. Even after his central line\n  was removed, it took until December for him to be weaned completely\n  off of morphine. And on January 16, 2018, after 222 days in the NICU, Miles was\n  finally stable enough to come home. But this wasn't the end of Miles's\n  medical adventures. Miles came home 100% ventilator and oxygen\n  dependent. He also was fed entirely through a g-tube and never took a bottle. For the past year and a half, Miles has made major strides. He's\n  learned to sit unassisted, to crawl, and even bear weight on his once\n  broken legs. He's grown strong enough to start weaning off the vent.\n  And he's begun taking some food by mouth. But Miles still has a\n  lifetime of obstacles to overcome thanks to his HPP. For Miles's second birthday, we are raising money for Soft Bones.\n  Soft Bones is an amazing organization that has helped us so much in\n  Miles's first two years of life. They offer support and resources to\n  HPP patients and families. They fund research to help better the lives\n  of patients with HPP, and hopefully to one day fine a cure for HPP. We\n  are honored to give back to this organization that has given us so much. For more information on HPP or Soft Bones, visit SoftBones.org", "url": ["https://fundrazr.com/milesturnstwo"]},
{"campaignTitle": "Kidney for Bryanna", "amountRaised": ["5,270"], "goal": "of $5k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jul 1, 2019", "numberContributors": ["52"], "story": "My daughter, Bryanna, needs a kidney. She is 19 years old and is one\n  of the hardest working, loving and hilarious young Christian woman I\n  have known. Unfortunately, while she was a junior in high school, it\n  was discovered that her kidneys were failing. She was diagnosed with FSGS, which causes scarring in the tiny\n  filters in her kidneys, rendering them useless. Several medications\n  were used in an attempt to slow the progress of the disease but her\n  body did not respond.  This past November she had a dialysis catheter\n  placed and started dialysis. She does her dialysis at home and has so\n  much responsibility between her daily 14 hour dialysis routine, many\n  medications, strict diet and weekly clinic appointments. As her health\n  declined, she has maintained a part time job and has taken classes at\n  community college as she wants to become a registered nurse. She has\n  nowhere near the stamina a 19 year old should have but she pushes\n  herself so hard. Wait time for a type O kidney in Michigan is 5-5 1/2 years. As a\n  parent it is gut wrenching to watch her suffer the fatigue, constant\n  nausea, and occasional depression. A suitable live donor has not been\n  found. Fort Worth, Texas currently has the shortest wait time in the\n  nation at less than a year is estimated. As a result, we are uprooting\n  our family and moving to Texas in order to have her listed there. We will be starting over with new insurance deductibles and, due to\n  moving expenses, paying her medical costs will be very difficult.\n  Please consider donating in order to offset the medical costs for her\n  current treatment and help us prepare for a transplant. All donations\n  will be kept in a separate account for her medical bills. Ability to\n  afford medical expenses (such as post transplant anti-rejection\n  medications) is necessary in order to be listed for transplant. We appreciate all support, whether it is monetary, a prayer or a word\n  of encouragement. Please be sure to consider becoming a registered\n  organ donor and be sure your family is aware of your wishes. There are\n  so many people like Bryanna who are waiting. Thank you so much for reading this and for caring.", "url": ["https://fundrazr.com/11Ugn5"]},
{"campaignTitle": "Help James get something off their chest!", "amountRaised": ["355"], "goal": "of $8k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["10"], "story": "About me: I’m a passionate animal lover from Roanoke,\n  VA working at a nonprofit animal welfare organization in the\n  Shenandoah Valley (yep, the same one the sad song is about). I was\n  privileged as a young adult to spend time in safe spaces, and I found\n  the latitude to question my gender. While I was described as a tomboy\n  in my childhood, there is perhaps more to the story as an adult. The Challenge: I am deeply rooted to nonprofits and\n  cause-based work, leaving little time and energy left towards pure\n  capital gain. That said, over my years of questioning, researching,\n  listening to trans people’s personal journeys, and amplifying voices\n  where and when I can, surgery is going to be part of my transition to\n  greater comfort in my own body and my own skin. While I find it\n  difficult to put into language the nuance of how I feel in my body,\n  the long and short of it is that I’m very uncomfortable with some of\n  its features that cannot be the shape I feel they should without top surgery. The Goal: The purpose of this fundraiser is to raise\n  money to pay for my top surgery. Donations will go directly to getting\n  something off my chest so I can continue my work in the nonprofit\n  sector with animals who have no voice otherwise. I humbly ask for your consideration among\n  so many other worthy causes. A few dollars, a few cents, is deeply\n  appreciated! Every contribution counts! No donation is too small!", "url": ["https://fundrazr.com/boobsbegone"]},
{"campaignTitle": "Lena's journey to become a Professional Sexological Bodyworker", "amountRaised": ["975"], "goal": "of €3k goal", "currencyType": ["Euro"], "endDate": "", "numberContributors": ["6"], "story": "I need your support to take part at the Sexological Bodywork\n    Professional Training in Berlin Welcome to my fundraising campaign. I need your help to pay for my six months training at the Institute\n  of Somatic Sexology to become a somatic sex educator. http://sexological-bodywork.institute/ Who am I? I am questioning things. I am curious, I am aware of the fact\n  that there is more then one truth, more then one way of living a life. My eating disorders brought me into studying nutrition, and\n  afterwards into becoming a chef in order to confront and step by step\n  to heal myself. Miscommunication and a lack of loving touch in my\n  family also took me on this journey. My trauma was drawing important\n  steps in my life so far. Now, I developed a understanding that working with my wound/\n  with my trauma is a life long journey. I see the importance of working\n  with and raising life energy. Our strongest life energy is our sexual\n  energy. Within every journey has to travel through sexuality. I feel I\n  need to support and heal other beings, especially women. I am able to\n  meet them where they are. I understand, because I am travelling the\n  same journey. In my opinion there is a connection in between our eating and\n  sexual behaviour, I would like to learn and to research deeper\n  regarding this interaction. What is a sexual somatic bodyworker? A Certified Sexological Bodyworker educates and empowers people\n  who are interested in their own erotic development. By using breath,\n  voice, movement, touch and massage, a professional sexual bodyworker\n  is providing a journey for people to find out more about their bodies,\n  sex and sexuality, or work through sexual issues or concerns. My goals with the course: • Being able to create and hold a safe space for people who are\n  on their journey of experiencing themselves by travelling through\n  their sexuality • Receive a professional education in ways to\n  touch individual people in a healing way • Being empowered to\n  share my opinion that sexuality should be free of guilt and shame and\n  to educate the next generation about healthy and stigma-free sexuality • Combining spiritual work like Yoga, Meditation, Pranayama,\n  Reiki healing, Estatic dance with knowledge and further research about\n  how to nourish our bodies on a celluar basis through food and sexuality To take part at this life changing experience I need your\n    financial support. It is an investigation into myself – that is truth- but longterm it is an investment in something bigger, deeper. It\n  is core work. Working on your real core, finding your truth, inner\n  self and also working at the core of life which is our sexual energy.\n  Finding ways for people to communicate and live sexuality with\n  awareness, presence and authenticity. Program of the training: Module One Online Group Study: May 3 to June 28,\n  2019 Module Two Embodiment Intensive: July 1 to July 13,\n  2019 Module Three Supervised Practice: July 19 to October 31,\n  2010 31, 2020 The full price oft he training is 3980 €. My goal is it to raise 3000 €! I would like to express my gratitude to every person who donates\n  over 100 € via a 60 minutes session of Reiki healing. I am a cerified\n  reiki healer, and I deeply love this energy work. If there is no\n  opportunity to meet I am offering a skype/zoom consultation after my\n  graduation in August. \"Great is the matter of birth and death. Life slips quickly by. Time waits for no one. Wake up. Wake up. Don’t waist a moment.\" I feel it is the right time to do this training. This is why I\n  don’t wait until a am financial stabil. I don’t want to procrastinate\n  things anymore. Don’t wait . I am looking forward to share my\n  journey with you. If you have any questions or would like to contact\n  me feel free to send me a mail. Lena", "url": ["https://fundrazr.com/e1UDk6"]},
{"campaignTitle": "Please help fund Emma's SRS surgery", "amountRaised": ["160"], "goal": "of $30k goal", "currencyType": ["Australian Dollar"], "endDate": "", "numberContributors": ["5"], "story": "I'm a male-to-female (MtF) transgender female. 23 years old. I'm first and foremost human who deserves happiness, like we all do :) Please help me in achieving a life awaited dream of mine. I've been on hormone replacement therapy (HRT) for nearly two years\n  now. Had a bilateral Orchiectomy in August 2014. Although I've been\n  transitioning ever since I was 19 with the knowledge Iam transgender\n  from a very young age. Since 2011 till present;  I have undergone more\n  than just physical and emotional changes.  I had/have to attend\n  numerous physiologist,  psychiatrist, endocrinologist, GP and many\n  other specialist appointments, tests/examinations and blood tests.\n  Along the side had and continue to put up with the financial and\n  emotional stress, and burden from society and my family. I moved out to be independent in May 2014.  Since then more drama had\n  developed.  Adding to the financial pain. All my appointments, tests,\n  medicine and travel is very costly and adds to the hole in my pocket.\n   Day after day i deal with a lot, just to get by without going crazy.\n   I have lost a job over who i am and been refused many since then.\n  Being transgender isn't easy, but it's who I am and I will do anything\n  in my power to be a full female; or die trying.  Unfortunately the\n  Australian Government doesn't cover my surgery.  I need this surgery\n  to live.  In order to function and enjoy being a full female,  SRS is\n  mentally,  physically and emotionally necessary. If you could help\n  make this dream, a reality that would be the most appropriated. Love cooking, baking, fashion, sewing, travel, animals, movies,\n  music, winter, tea and health. Thank you!", "url": ["https://fundrazr.com/dwIO5"]},
{"campaignTitle": "1PL8 4 GOOD Join a new Campaign \"Brain Food 4 NextGEN Entrepreneurs\"", "amountRaised": ["4,117"], "goal": "of $88.9k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["5"], "story": "The world faces many challenges. And sometimes we feel\n        helpless and hopeless in our own homes. Today, we're inviting\n        you to a special campaign called 1PL84GOOD, where each day you\n        can sit down and eat a sensible plant-based diet that will\n        affect your health, your community, the environment and the\n        future of our world. Based on the Principles of human empowerment and American\n        ingenuity, WE can all start with one plate, to Be the Change we\n        need. Welcome to the campaign. Try a #PlantPowered Brain Food 3 Meals a Week Share with 8 friends Version 3.21 20 May 2019 Working demonstrations of these campaigns: 1PL84Health    - Accept the # ClimateBurger2020 Challenge\n    with 8 of Your friends Via http:// bit.ly/CBC2020v1 http://bit.ly/PlantPowered2020 Your contributions are most welcome as a Share through\n      social media OR by claiming a Perk from the list.", "url": ["https://fundrazr.com/1PL84GOOD"]},
{"campaignTitle": "Help Mel's Road to Recovery", "amountRaised": ["140"], "goal": "of $18k goal", "currencyType": ["U.S. Dollar"], "endDate": "Nov 30, 2019", "numberContributors": ["3"], "story": "My name is Melanie and THANK YOU for visiting my page! I am raising\n  money to alleviate a portion of the financial stress that comes with\n  having thousands of dollars worth of medical debt as a college student. In 2015, I was diagnosed with an eating disorder which has been with\n  me since 2008. Eating disorders affect over 30 million people in the\n  United States, and after a long period of denial, I recognize that I\n  am one of those people, and that my life is at stake if I continue.\n  Starting with the diagnosis in 2015, I have begun to seek recovery. Unfortunately, my first stay in residential treatment was not as\n  effective as I'd hoped, in part because it was cut short due to\n  financial stress and lack of adequate insurance coverage. Though there\n  have been periods of decreased symptom-use while seeing an outpatient\n  therapist, my health has continued to decline as symptoms have\n  continued, especially with new stresses being introduced without the\n  tools to manage depression and anxiety symptoms. This time around, things are vastly different. I've grown a lot, been able to keep a job as a Nurse's Aid where I\n  love taking care of the elders and bonding with them. However, I've\n  had to step away from that for the time being in order to give\n  recovery a real chance, so that I can not only be out of the woods\n  medically, but move on to the rest of my life as a healthy individual\n  with a healthy relationship with others, starting with myself. As of Monday, June 10th, I will be admitted to Magnolia Creek's\n  residential program just outside Birmingham, Alabama.  I know that I\n  need this level of care to get myself to a healthy place, whatever the\n  cost. However, it is not a cheap decision. Any help whether in prayers\n  or in finances would be graciously received. I've been blessed with amazing, encouraging friends and coworkers as\n  well as an adorable, faithful dog. If you would consider even giving a\n  small contribution to this cause, my appreciation would be\n  unfathomable, and you would quite literally be my hero. I thank you in\n  advance for your kindness and generosity, and may God bless.", "url": ["https://fundrazr.com/melsroadtorecovery"]},
{"campaignTitle": "Nakula (Neo) In need of urgent medical help for PTSD!", "amountRaised": ["515"], "goal": "of $1.8k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["9"], "story": "Nakula (Neo) celebrated his 22nd Birthday! On April 29th, 2019! He woke up early that morning and I showed him all the\n    donations that he had received from all over the world and he just\n    could not believe the support he was receiving! Thanks so much, to everyone who has come forward so far to\n    make life more wonderful for Nakula. Nakulas Story He has been suffering from severe PTSD for the past few years\n    and he has just recently started taking high-quality CBD, and\n    medications. He is receiving Hypnotherapy and professional medical\n    attention and his condition is improving, yet in order for him to\n    continue receiving the care he needs and\n    professional psychological counseling on a consistent basis, we will\n    need some help financially to cover all his medical expenses! He has started seeing a psychologist once a week in his house\n    for PTSD symptoms which are pretty severe, because he could not make\n    it into town for weekly visits, a house has been set up for him in\n    the countryside where he has a volunteer working and living with him\n    full time that is similar to a big brother mentoring situation. He is in desperate need of consistent mental health care and\n    engaging in activities with kind-hearted people encouraging him in\n    his healing process, step by step progress is being made. At this time it is difficult for him to leave the house so he\n    gets isolated, he tends to get paranoid, depressed and fearful, then\n    he doesn't want to leave the house. All the costs involved in his care are a bit difficult to\n    manage, so we have decided to reach out and ask for help for him,\n    and hope that collectively we can pull together and help him out so\n    he can get the medical attention he needs to get better and thrive\n    in life. How You Can Help If you want to make a donation one time or on an ongoing\n    monthly basis of an amount that feels comfortable, it would be\n    appreciated so very much at this time! We are aspiring to raise $300 a month on an ongoing basis or a\n    total of $1800 to cover his costs for 6 months for his medication\n    and in-home professional counseling costs in Costa Rica. The idea is that if everyone contributes a small amount\n    monthly that this can be achieved. Monthly and one time donations can be sent on Paypal to yogaofbeauty@gmail.com If you have any questions in regards to setting up a monthly\n    contribution please contact us directly at the above email address. There are also options on FundRazr to remain anonymous in\n    making your donations. We kindly ask you to consider donating to help Nakula at\n          this time and that we stand together as friends, and family\n          near and far to help heal his PTSD. If we all give what we can and share this with our various\n        friends and networks then Nakula 's healing\n        journey will be made so much easier by us all joining together\n        to show how much we care! Thank you all for your thoughts, prayers and generous donations...", "url": ["https://fundrazr.com/71RJb6"]},
{"campaignTitle": "Fundraiser for Michelle Smith", "amountRaised": ["7,065"], "goal": "of $20k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jun 25, 2019", "numberContributors": ["68"], "story": "Hi my name is David Prendergast and I wanted to invite you to a event\n  to help my sister Michelle Smith with her fight against cancer. We are\n  holding a pig roast and beer fundraiser for Michelle Smith to help her\n  pay medical bills and expenses related to her cancer treatment. Michelle is battling uterine cancer. We want to support her in her journey.", "url": ["https://fundrazr.com/e1Vcz9"]},
{"campaignTitle": "American Gut", "amountRaised": ["1,846,245"], "goal": "", "currencyType": [], "endDate": "", "numberContributors": [], "story": "The Human Microbiome Project and other microbiome projects\n    worldwide have laid an important foundation for understanding the\n    trillions of microbes that inhabit our bodies and their impact on\n    health and disease. However, opportunities for the public to get\n    involved in such research have been limited. Now, American Gut gives\n    you an opportunity to join this research project and learn what’s\n    living on and inside you. American Gut is a project built on the open-source, open-access\n    principles of the Earth Microbiome Project. The data we collect is\n    de-identified and then deposited into open repositories for the\n    benefit of other researchers and scientists.  By participating in\n    our project, you can help contribute to research that will help the\n    world understand how the microbiome affects our health. In exchange\n    for your participation, we generate a report summarizing the types\n    of microbes observed in your sample, and how your sample relates to\n    other people in the study. While American Gut mainly focuses on the gut as this is where\n    most of our microbes reside, we will also look at areas like the\n    oral and skin, as these areas of the body also contain microorganisms. The American Gut Project is a part of the Microsetta Initiative , with\n    the goal of collecting microbiome samples and rich phenotypic data\n    from populations across the globe. Some examples of what we have found using our data: Younger\n  children tend to have more proteobacteria composing their microbiome.\n   As you grow older, the diversity of your microbiome increases. (Based off our preliminary findings in 2014,\n      found here ) There’s a significant difference between the types of bacteria\n    found in industrialized populations vs. non-industrialized populations. McDonald et al. mSystems . May 2018. DOI: 10.1128/mSystems.00031-18 If You Live in the U.S.: Joining is\n    simple! Select the kit you would like from the list of options on\n    the right-hand side by clicking “Claim this perk” (if you would like\n    to receive a certain number of kits that isn’t listed as a perk,\n    email us at info@americangut.org ) . Your kit\n    will arrive via USPS within 2 weeks after payment, unless you have added the “Priority Shipping”\n    perk along with your kit. If You Live in Europe: Visit our sister site, British Gut , to join. If You Live in Australia or Singapore: While we do have sites set up in Australia and Singapore (known\n    as Australian Gut and Asian Gut respectively), we ask that participants contribute an additional $25 on top\n    of their contribution, which covers an international shipping fee . These sites allow participants to send their samples back to a\n    local site, which then sends the samples back to our lab in the U.S.\n    to reduce the costs of shipping. If you live in Australia or Singapore and would like to\n    participate, claim a perk.  The next page will have an option to\n    \"top off\" your contribution with an additional amount,\n    which you will use to add in the $25 to mark your kit to go out. I f you do not include the $25 shipping fee, your kit will not be\n      sent out until we have received it. Once we have received your transaction, we will forward your\n    information to our collaborators. They will then send out a kit to\n    you, which you will receive within 3 weeks . Please note that the r eturn time for results will take significantly longer than the\n    expected 3 months for Australian/Asian Gut participants. The reason\n    is that we have to bulk ship samples on dry ice back to our lab at\n    UC San Diego.  This costs thousands of dollars per shipment, so it’s\n    only feasible to do once enough samples are ready to ship. If You Live Anywhere\n    Else: International participants are also\n    welcome to join. The $25 international shipping fee also applies (which you must include in your contribution), along with other regulations . I f you do not include the $25 shipping fee, your kit will not\n      be sent out until we have received it. We also ask that samples are shipped back to our lab within 48 hours of being collected. The cost of shipping to our lab in the U.S. from some\n    locations can be expensive , so it is recommended that you look into the cost of return\n    shipping (it is highly suggested to use FedEx as it is more\n    reliable). If you are interested in learning the process of our project\n    from start to finish, we have a video available here . Each kit contains a sample tube (or more, if ordered), an\n    instruction manual on how to register your kit and take a sample,\n    credentials to access our participant website, and return\n    envelope(s) to send your sample back. Your results will provide a general overview of how your microbial profile\n    compares to other participants ( these results are not intended to be medically actionable,\n      and we cannot provide any personalized interpretation ). You will also receive a list of the microorganisms found in\n    your sample and their relative abundances (based at the genus\n    level).  Results are uploaded via our participant website, which you\n    will get access to once you register your kit. For stool samples, it will take about 3-4 months for you to receive your results, and longer for those who are\n      participating outside the U.S. (due to shipping procedures to send\n      samples back to our lab, which is based at the University of\n      California San Diego).  It takes approximately significantly\n      longer (5+ months) to receive results if you submit one of the\n      following sample types: Oral or skin samples . A desktop computer or laptop is recommended to register and log your sample into our\n      participant portal website, as our participant website has\n      compatibility issues on mobile devices and tablets.  The best\n      browser to use when you register your kit is Google Chrome . Note that your de-identified information will be part of a\n      research study and will be made available in a publicly available\n      research database. That is, any personal information that might\n      easily identify who you are will be removed before being placed in\n      the public database. If you decide that you no longer wish to continue in this\n      study, please send a request to the American Gut Project help\n      account ( info@americangut.org ) to inform us of your intent to withdraw. You may request a\n      refund within 50 days of your original payment if you have not yet used your kit. Please note that the Fundrazr transaction fee will be\n        deducted from your refund. The consent forms are maintained on the participant website;\n      details are included in your kit. To sign the consent form, you\n      must agree to use an electronic format for your signature in\n      accordance with the United States' eSIGN Act and California's UETA\n      Act. You have the right to obtain the electronic record in a\n      non-electronic form. The results you receive from submitting a sample are not\n      meant to act as medical or health diagnoses . We will not be able to provide any clinical or medical\n      information and recommendations from your results. If you have any questions or concerns, please email us at info@americangut.org.", "url": ["https://fundrazr.com/americangut"]},
{"campaignTitle": "Support Chris on Her Healing Journey", "amountRaised": ["40,721"], "goal": "of $60k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["139"], "story": "Update: After successful surgery for what doctors\n  have now classified as stage 4 colon cancer , Chris\n  will be receiving follow-up chemotherapy treatment beginning March 27\n  at City of Hope. During the first phase of treatment, a small spot on\n  her liver grew to the size of a quarter. It was successfully excised\n  in surgery, along with her gallbladder and approximately 13 inches of\n  colon. But, due to the extremely aggressive nature of this cancer\n  (which actually GREW during radiation), her doctors feel this course\n  of follow-up treatment is vital to giving her the best possible chance\n  at a full recovery. THANK YOU for your continued support of our dear friend! How you can help: Donate here to Chris's ongoing care while she is\n      in treatment and unable to work. Share this page on social media and with others who may be moved to help: fundrazr.com/ChrisStrother Book a family photo shoot with Chris - contact her\n    directly or email chris@hootowlstudios.com . Chris's Story Chris has been diagnosed with stage III colon cancer, a huge\n    shock to us all. If anyone is a survivor, Chris Strother is the ultimate!  But we\n    know that the cancer is aggressive and she must move forward\n    rapidly. Chris is preparing to undergo conventional cancer treatment\n    while continuing to support her overall health with a variety of\n    integrative & complementary therapies. During the coming months, Chris will be unable to work at her\n    normal capacity. As a single mom, she is very aware that this means\n    she will need help. If you know Chris, you know that accepting this\n    kind of help does not come easy for her. But, we have convinced her\n    that relieving some of her financial burden will allow her to focus\n    all of her energy on healing. Our goal is to raise funds to cover\n    one year of medical and living expenses. We are hoping to raise funds to help her with medical co-pays;\n    living expenses; integrative nutrition; ongoing expenses for her\n    son, Eli; and complementary therapies that are not covered by insurance. Chris is a precious and inspiring friend to many, a true renaissance\n  woman with extraordinary gifts to further bring to our world. We are\n  inviting her friends, fans, and community to support her during this\n  challenging time. We want her to know that we are here for her, as she\n  has been for so many of us.", "url": ["https://fundrazr.com/ChrisStrother"]},
{"campaignTitle": "Help create balance on the planet through music", "amountRaised": ["950"], "goal": "of $2.5k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["12"], "story": "Hi we're Ben & Cassie, founders of Soul Fit NYC, a wellness\n  company dedicated to creativity, self expression and healing for all\n  people on the planet. Early this year our friend Richard Miller, a brilliant Brazilian\n  guitarist approached us about a concern and idea he had to solve it.\n  He told us a little known fact: over 60% of professional musicians are\n  forced to end their careers early due to injury. Richard knows that it\n  doesn't have to be that way. Rather than feeling sorry for himself and\n  those affected by injury, he took action. He created an idea for a\n  healing retreat in the healing land of Costa Rica, especially for\n  guitarists. It's called \"Balanced Guitar.\" It's a retreat\n  that addresses injury prevention through balance. With yoga, surging,\n  Tai Chi, massage, guitar instruction and healing food, Richard knows\n  he could make a difference. We loved the idea! Like Richard, Cassie and I saw the possibility of\n  this retreat and the huge  impact and possitive benefits this retreat\n  could have for anyone who participated (musicians or not). We hit the\n  ground running and made Richards dream a reality. This January 5th-13th, Balanced Guitar will happen in the healing\n  land of Nosara, Costa Rice. Students from all walks of life and\n  economic backgrounds will study guitar technique from brilliant\n  teachers like Freddie Bryant (Professional Guitarist, Professor at\n  Berklee School of Music & Tai Chi instructor) & Richard Miller\n  (professor at Columbia and Driectoe of Programming for the Afro-Latin\n  Jazz Alliance in NYC). Iyengar Yoga will be taught by master teacher Rosa Santana. Thai\n  Massage will be provided by Cassie Fireman. Surfing lessons will be\n  taught by Richard Miller himself. Organic, home cooked meals will be\n  cooked by local, Costa Rican chef: Robin. All this costs money and time. We have very little time remaining and\n  we have more money to raise. We especially want to raise money to help\n  send students to our retreat who can't afford it on their own. Please consider making a donation today. No amount is too small (or\n  large) to make a difference. If if you or someone you know would like to attend the retreat, we\n  have a few spots left. Check out our website at www.BalancedGuitar.com or email ben@soulfit.nyc for more information. Pura Vida, Ben & Cassie", "url": ["https://fundrazr.com/815G31"]},
{"campaignTitle": "Pediatric Brain Cancer - Brave Like Georgia", "amountRaised": ["615"], "goal": "of $1k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jun 17, 2019", "numberContributors": ["12"], "story": "Meet Georgia...in this picture, February 16th, was the first\n    day Georgia started complaining of headaches. Soon after, she was\n    diagnosed with. She has already triumphed over so many medical issues in such a\n    short amount of time - brain surgery, blood transfusion, days of\n    severe pain throughout her body, high fevers, extreme nausea, hair\n    loss, and she just finished 6 weeks of chemotherapy and yet, the\n    list goes on. The\n    location of concern is against her brain stem and her oncologist\n    said if a second brain surgery is needed, it will have to be more\n    aggressive with the likelihood of damage happening. The sooner\n    Ependymoma is removed completely, the better it will be for her. We\n    are praying and having faith that Georgia will be completely healed\n    and a second brain surgery will not have to happen ✝️❤️ She had an MRI on Tuesday morning. While they await the determination for a second brain surgery, I need your help and support to give back to Georgia and her\n    family. Each donation is being matched by Usborne Books & More. The donations will be used for medical expenses, gas, food, and more. If possible, can I count on you to donate $50?", "url": ["https://fundrazr.com/01Vhl4"]},
{"campaignTitle": "Help Us Make Ireland's Dream a Reality!", "amountRaised": ["1,832"], "goal": "of $500k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["26"], "story": "Hello, we are Megan and Mark. Over three years ago Megan gave birth\n  to our beautiful baby girl, Ireland. However, during birth, an\n  umbilical cord prolapse resulted in Ireland having cererbal palsy. She\n  spent the first 7 weeks of life in the hospital, and we waitied\n  anxiously to take her home to her older brothers. This was our first real world experience with cerebral palsy. Many\n  people we talk to today don't even know what cerebral palsy is.\n  Cerebral palsy is a variable type of brain injury that affects people\n  in many different ways. Some children are only slightly affected,\n  while others are permamently disabled, wheelchair-bound, and need\n  constant attendant care. Cerebral palsy makes a huge impact on the family dynamic. Not only\n  are many cerebral palsy families financially dessimated by this\n  disease, but they are also stressed emotionally and physically. There are no treatments out there that are covered by insurance to\n  treat or reverse cererbal palsy. However, there are many, many\n  therapies available worldwide that improve cerebral palsy, and can\n  have significant impacts on quality of life. Unfortunately, most of\n  these therapies are difficult to obtain due to lack of insurance\n  coverage and travel costs. We were lucky enough to discover and utilize many of these therapies\n  for Ireland, and have seen dramatic improvements in her since using\n  these therapies. We truly believe that no child with cerebral palsy\n  should have his or her treatment options limited by his or her\n  parent's financial status. Out of this belief, Ireland's Dream was born. Ireland's Dream is to establish a medical center that is fully\n  dedicated to the treatment of people with cerebral palsy and their\n  families. This Center will have the latest in treatment technologies\n  that people all over the world are using for cerebral palsy, available\n  under one roof. These therapies include hyperbaric oxygen, ozone\n  therapy, Cuevas Medek therapy, scoliosis treatment, and vibration\n  therapy. Other necessary therapies will include family counseling,\n  diet/nutritional interventions, feeding therapy, assistive device\n  training, and more. Our goal is to make cerebral palsy synonymous with Ireland's Dream.\n  Please help us make Ireland's Dream come true for patients all over\n  the country who are suffering from the debilitating disease. We thank you greatly for any support you can provide.", "url": ["https://fundrazr.com/f13EF1"]},
{"campaignTitle": "Ceiling lift for Ryan’s 12th birthday", "amountRaised": ["2,205"], "goal": "of $3.8k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jun 22, 2019", "numberContributors": ["27"], "story": "Our son, Ryan, is 11 years old and suffers with Miller Dieker\n  Syndrome. He needs total care for all of his needs and daily\n  activities. He is now 74 pounds and getting so heavy for us to lift.\n  We have sent a letter of medical necessity and applied twice for a\n  lift to Ryan’s Medicaid but have been denied even after appealing. His\n  12th birthday is coming up on June 21st and the only thing I can think\n  of that he needs is a manual ceiling lift. This will help us safely\n  get him from his bed to his wheelchair or to his bath chair. He has\n  been getting bed baths for a year now despite having a rolling bath\n  chair and a walk in shower to use because it is no longer safe for us\n  to lift him especially when he is wet from the shower. He also goes\n  many places throughout the week (church, therapy, and family outings)\n  and we do not want him to be limited from these activities because we\n  can no longer lift him and put him in his wheelchair. We do not want\n  him to become bed bound. We have found a manual ceiling lift and track\n  system at the lowest price possible that will meet his needs and have\n  attached pictures. Thank you for sharing or story or donating to his\n  fund for his 12th birthday!", "url": ["https://fundrazr.com/91VMaf"]},
{"campaignTitle": "Please Help Marccelo!", "amountRaised": ["3,450"], "goal": "of $30k goal", "currencyType": ["U.S. Dollar"], "endDate": "Aug 16, 2019", "numberContributors": ["37"], "story": "My name is Guissela, and I'm the mother of a miraculous little boy. \n  As a mother of 2 boys with very different disabilities, there is\n  nothing more terrible than seeing your child in pain over and over\n  again. Well for me it was my 14-year-old son name Marccelo. After 2 spinal cord surgeries, we thought we missed the bullet\n      when we were granted a miracle after a surgery that helped him get\n      stronger and able to finally take his first steps with a gate\n  trainer . But just like that our happy little hero's\n  progress stopped.  When Marccelo started 8th grade, he suddenly began to get weaker and weaker and lost the ability\n      to control his neck and lower extremities .  He also lost his spirited smile . I can still hear him asking me, \"Mommy what's going on? Why can’t I move my hands?\" I wish I could have given him a positive answer so he\n  could have felt better knowing there was something we could do about\n  it. Unfortunately, we got the sad news that he would need yet another\n  spinal surgery; only this time it would have to be a spinal fusion and his life would be in\n      jeopardy. Marccelo could lose the little strength he has left and\n      be put on a ventilator for life. I am still praying\n  for the courage to take that risk. Marccelo was born on November 22, 2004, the week of Thanksgiving. I\n  was thankful to God for giving me such a beautiful blessing. I was\n  beyond happy and felt I was the luckiest mother alive. On the day of\n  his routine 9-month checkup, the doctor gave me the first of many bad\n  news to come. Marccelo needed to be seen by a specialist due to the\n  fact that he was very floppy. I took Marccelo for an MRI where I was\n  told that he needed a spinal decompression. At only 13 months Marccelo\n  had his first spinal surgery. Doctors told me he would never walk, speak, eat and that he\n      would live his life permanently in a wheelchair. At\n  that moment my world collapsed. I couldn't understand why this was\n  happening to me. My faith was tested and I was angry at God for what\n  he was doing to my child. It was the saddest day of my life. I gained strength and decided to give my son the best life I could .  I was on a mission to prove the doctors wrong. So as Marccelo grew up, I never treated him differently, nor did I\n  make things easy for him. I wanted him to give it his all so he could\n  become independent and succeed in life. At the age of 3, he was able to sit up, use his little hands to\n      sign, speak with difficulties, eat on his own and do many things\n      regular kids his age were doing. Of course, the\n  walking part was a bit difficult. Regardless, Marccelo learned 2 languages, his letters, colors and numbers\n      before he went to kindergarten. I was so proud, and\n  happy for him. I knew there was something special about Marccelo that\n  went beyond the fact he was my son. He always had an incredible way to touch hearts and inspire\n  love. He is compassionate toward those suffering and has\n  always been a peace maker.  This is why I believed him when he told me\n  he had an encounter with God. In 2017, just before Marccelo’s second spinal decompression, he\n      shared his story about a guardian angel coming to\n  him.  He described his guardian angel and a message God shared with\n  him about helping other children get to heaven.  He told me he met my\n  grandmother who passed away 28 years before, telling me she had a\n  message for me.  She called me by my pet name and said things about me\n  and our relationship that Marccelo was not aware of.  I get goose\n  bumps whenever I share his story.  After the experience, Marccelo went into his surgery full of faith and optimism\n    with an unprecedented recovery in spite of what the doctors had told\n    me to expect. That was why we thought we dodged a bullet. Marccelo has always been a kid who enjoys every second of the day, is\n  outgoing, and still believes in his dream of becoming a famous video\n  game player or cop!  Making sure everyone is happy, he consistently\n  finds the best in the worst. He is so loving and supportive to his\n  older brother who has autism...and to me, encouraging me when I would sometimes be brought to tears when\n      my body would give out while trying to lift his chair into the\n  car. My body, never my will, because I know I need to\n  continue to be strong for him and his brother. There are no limits to what I would do to see my son smile\n  again. The pain of watching him go through this is\n  insurmountable.  I would take it all myself if it would lessen it for him. Today we face a bigger challenge. I am trying to ready myself and Marccelo for his third spinal\n      cord decompression and fusion surgery. I am praying\n  he will not have to be on a ventilator for the rest of his life, but I\n  have to be prepared in case the doctors are right. I admit, it is\n  overwhelming. Not just because money is a big issue but because time is running out and a lot of changes have to be made to make\n      it all happen before his surgery. Following is a\n  list of what we desperately need.  Fortunately, I was able to take a\n  few things off the list because insurance is covering them.  Insurance\n  is not covering the following: A wheelchair with a head array so Marccelo can move around independently,\n        having the autonomy to continue to learn and have some fun\n        playing games . An accessible mobility van because as he gets older, he is getting heavier. I can’t\n        carry him anymore because it is not safe. We need a one level home with a room big enough for his medical bed, lift, and any\n        other equipment he might need after surgery, also with an\n        accessible bathroom so he can move around. Marccelo is not the only kid in need; we are not the only family in\n  need. I'm only a very tiny percentage who are blessed to have come\n  across a tremendous network of people who are encouraging me to take\n  this step of reaching out to others for help. We a beyond grateful for anything you can give to help us get\n      through this. A forever thankful mom, Guissela", "url": ["https://fundrazr.com/Marccelo1122"]},
{"campaignTitle": "Urgent Support Needed for Tony Dowling's Cancer Journey!", "amountRaised": ["26,060"], "goal": "of $60k goal", "currencyType": ["Australian Dollar"], "endDate": "Jul 1, 2019", "numberContributors": ["71"], "story": "Hi, my names Matt my wife and I have been friends with Tony and Tracy for nearly twenty\n    years. They are a beautiful family and it was such a shock when I\n    got the call from Tony recently telling me of his cancer diagnosis! I’m sure most of you have been following his journey as we have\n    and are sending a constant stream of love, positive thoughts and\n    prayers their way. I spoke again with Tony last week and heard the n ews of\n    the new diagnosis and upgrade from stage 1 to stage 4. Truly heartbreaking to hear, but Tony is as positive and\n    faith-filled as always, a true inspiration, we stand strong with\n    them believing for a full recovery! He told me briefly of some of the struggles of dealing with the\n    unexpected expenses and also the obvious loss of income etc. but\n    expressed that he knows that God has it all under control and that he is confident of a positive outcome. After our chat I got off the phone and probably like many of you\n    who are not physically located near Tony and Tracy in Sydney\n    Australia, I thought to myself, there has to be something we can do to help, so I have set up this campaign in\n    the hope that you will all join us in standing together to help make\n    a massive difference to Tonys journey! Following is a snapshot of the Dowling family, a link to Tony’s\n    journey so far which you can follow and the reasons why our\n    donations are so very vital and impactful at this time for them... Tony is 46 years old and has been married to\n  Tracy for 19 yrs. They live on the northern beaches of Sydney with\n  their two boys Max 16 and Noah 14. The family is heavily involved in\n  local basketball through the boy's school and the Manly representative\n  level comps. Tracy is involved at the boy's school and helps\n  co-ordinate and manage multiple basketball teams. Tony has a background as a school teacher,\n  business entrepreneur and currently works in training and software\n  development. They are active members of the local community, and\n  church and love travelling, family time and adventures of any kind. Tony and Tracy have impacted the lives of so many people around the\n  globe and locally with their big hearts and generous souls. We all have been positively influenced by this amazing couple in some\n  shape or form, through either school, community, business or church\n    life. Here is a link where you can follow Tony’s journey and progress: https://www.mylifeline.org/invitation/FOTY/b53c54fcc2abfed6f3d977439df0c4c309e98f36fff675b0772a480f52894be2 How we can help: Tony has just had surgery to remove bowel cancer which has also\n  spread to his right lung. Tony’s diagnosis has now jumped from stage 1 to stage 4! This means that it is full steam ahead for aggressive chemotherapy\n  treatment for the next 6 mths, followed by lung surgery around\n  November 2019. They are in the process of trying to access some insurance funds, but\n  there is a 3 mth waiting period that is not covered and then funds\n  will still only cover 3/4 of normal income. On top of that, there are all the additional medical bills, hospital\n  expenses, gap payments, medications and day to day additional expenses\n  that come with this type of treatment... We want Tony, Tracy and the boys to be able to focus on the important\n  things and keep any additional stress to a minimum. We would like to\n  provide enough to get them through this 4 month transition period and\n  also give them a buffer so that there is not a financial burden and\n  pressure on them over the next 6 months. We would like to enable Tracy to not have to take up any additional\n  work to cover any shortfall and added expenses, but be able to spend\n  the time with Tony and attend to all the necessary appointments and\n  give him all the required care and attention needed at this time. After calculating the amount needed to cover their everyday expenses\n  keeping them afloat and to keep life as normal as possible, plus\n  enough to help cover their ongoing medical costs for the next 6\n  months, we have set a goal to raise $60K. Anything above that will go towards any additional ongoing medical\n  expenses and treatment required. We kindly ask you to consider donating to help bless Tony\n        and his family at this time as they link arms and stand together\n        with friends, and family near and far to fight this nasty thing\n        head on! If we all give what we can and share this with our various\n        friends and networks then Tony and His family’s journey will be\n        made so much easier by us all joining together to show how much\n        we care! Thank you all for your thoughts, prayers and generous donations... God Bless!!", "url": ["https://fundrazr.com/f1TtQ0"]},
{"campaignTitle": "Mama Rose needs Hyperbaric Therapy.", "amountRaised": ["3,343"], "goal": "of $6k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["29"], "story": "In October 2017, Rose Rios suffered from a stroke leaving her\n  immobile and incapable of caring for herself. The results of the\n  stroke caused Complex Regional Syndrome, Vascular Dementia, Aphasia\n  and have severely shifted her life activities. Rose’s family is unable to fully provide the financial assistance to\n  help her receive the care needed to get better, heal and get back the\n  fun, vibrant colorful life she lived & felt just a year ago. Rose is surrounded by many friends and family who help take care of\n  her around the clock but unfortunately with climbing medical bills\n  from physical therapy, doctor’s visits, and the medication needed 2\n  times a day- it’s getting more and more difficult. Update on Rose Rios 4.29.19 Rose was hospitalized 2 months ago & has digressed a bit, but is\n  still stable. Her everyday routine continues to be a struggle with her\n  waking up, using the restroom, eating, taking medicine and traveling\n  to appointments. After seeing many specialist, they have concluded that hyperbaric\n  oxygen treatments will help with her health and prolong her life. Hyperbaric oxygen therapy involves breathing pure oxygen in a\n  pressurized tube. The Hyperbaric chamber is used to treat stroke\n  victims with significant results. The price for this is $1,920/mo, including an oxygen mask, plus a\n  lift fee to place her in the chamber. The doctors would like to do\n  this for 2-3months, to see if it substantially improves her recovery. Any donations, advice or help is truly appreciated to help us as we\n  grasp for ways to help alleviate any amount of suffering and obstacles\n  for Rose.", "url": ["https://fundrazr.com/MamaRiosfundrazr.com"]},
{"campaignTitle": "Help James McCarthy in his battle against leukemia", "amountRaised": ["152,820"], "goal": "of $100k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["976"], "story": "How you can help: Donate to James’ care: https://fundrazr.com/campaigns/f1OA33/pay Register to be a bone marrow donor: http://www.bethematch.org/ James’ Story: On Tuesday, August 7th we were leaving the house for Rita’s birthday\n  dinner when we received a voicemail from James’ doctor. She said to call immediately and left her personal cell phone\n    number. As we walked, James was being his usual self:\n  running down Southport Ave and acting like a healthy, happy little\n  boy. Forty-eight hours later, James would be in critical\n  condition, on a ventilator, and fighting for his life.  Two days after\n  that James was diagnosed with an extremely rare form of Leukemia. When we called the doctor back, she shared that a routine blood test\n  showed James’ white blood cell count was abnormally high and she\n  wanted us to get more tests done by the Leukemia and cancer\n  specialists at Lurie’s Children Hospital. To put it in\n  perspective, healthy children usually have a white blood cell count of\n  5,000 to 10,000. James’ was at 32,000. Thursday was the soonest appointment we could get with a hematologist\n  - a doctor who specializes in diseases of the blood. The\n  doctors at Lurie’s confirmed that something was not right. They wanted to get a bone marrow sample to figure out what was\n  going on and the quickest way to the front of the line was to have\n  James admitted. At that point, there wasn’t a high level\n  of concern for James’ immediate health. We spent the day\n  playing with trucks, reading books, watching “gee” (Curious George)\n  and looking at cars, trucks, buses and all his favorite sights of the\n  city from the hospital room window. On Friday morning at 9:30 am, James underwent a procedure to extract\n  a bone marrow and a bone sample from his hip. The\n  doctor’s shared what they were testing for: James likely either had\n  Leukemia or an auto-immune disease. Devastation. A few hours later the oncologist (cancer doctor) called us to the\n  consultation room for a discussion. She shared what was\n  seemingly good news. The initial blood results had ruled\n  out the most common types of Leukemia, which typically make up more\n  than 99% of annual childhood Leukemia diagnosis. The\n  only cancer they couldn’t rule out was a very rare form of Leukemia\n  called Juvenile myelomonocytic leukemia, or JMML. We\n  would later learn that JMML is so rare that there are currently only\n  20 kids diagnosed in the U.S. While we didn’t yet have an answer for what was affecting James, we\n  cautiously celebrated the news since the other options were an auto\n  immune disease or pneumonia.  We were told the rest of the tests would\n  likely come back on Monday. That night James’ health rapidly deteriorated. His\n  temperature spiked to 104. His heart rate was racing at\n  200 beats per minute. His lungs began to fail. To help his little body the nurses and doctors put him on\n  oxygen and a few IVs. While we were scared – and not\n  knowing what was happening – we at least had the benefit of being able\n  to talk to the doctors. James didn’t. As the night progressed, the doctor’s wanted to increase his oxygen\n  to help with his lungs; and to do so, he needed to be moved to the\n  Pediatric Intensive Care Unit (PICU) and only they could administer\n  the higher dosage. For the next 24-hours, James would not rest; his body would not let\n    him. Each time he did fall asleep, he would wake up 10\n  to 20 minutes later terrified and not knowing what was happening.  His\n  body was in overdrive, IVs and sensors all over his body, a tube\n  inserted down his nose into his stomach – how could he understand? It was excruciating. His body was being\n    overworked. He was having trouble breathing. He was not getting the rest needed. He was\n  pleading with all the words he had.  “All done.” “Momma.” “Up.”\n  “Outside.” It was heartbreaking and terrifying to watch\n  our poor little baby so scared and so sick, feeling completely helpless. The PICU team told us what we could already see.  James’ body\n  could not sustain this pace on his own, so we made the decision to\n  sedate and intubate him (put on a breathing machine.) It\n  was mentally impossible to hear but we knew it had to be done.  We sat\n  bedside with James as he was sedated and the breathing tubes inserted\n  into his lungs.  This was two days after we walked into the hospital\n  with a seemingly healthy little boy. Saturday brought a new bombshell. The only piece of\n  good news we had received instantly disappeared. Our\n  James had JMML, the rarest type of childhood Leukemia. The doctors now suspected that James did not have pneumonia. Instead it was leukemia filling his little lungs with white\n  blood cells. James’ white blood cell count accelerated\n  rapidly throughout the day from 30,000 (which we previously thought\n  was unimaginably high) to 50,000 to 78,000 to 90,000 to 111,000 to 128,000. Our little James was now in critical condition. Some of\n  the best doctors in Chicago were working with him minute-by-minute,\n  hour-by-hour to keep him going. Everything had happened\n  so fast that we didn’t even have time to process one bit of news\n  before we had moved onto another. But we kept in mind\n  one thing: if you’ve met James, you know he is a strong-willed little\n    toddler. If anyone can battle this, it’s James. While James’ lungs were responding to the breathing machine, it\n  wasn’t enough.  The doctors decided to move him to a\n  new ventilator that could also administer anesthesia gas in addition\n  to breathing for James.  This machine had to be brought up from the\n  E.R. and had only been used a few times on the PICU floor over the\n  past two years. We were told James may be the sickest\n  patient in the hospital (438 patients) and that he was fighting for\n  his life. We were grasping for straws. The doctors told us they\n  were running out of things to try. We\n  discussed unproven options that had never been tried on a patient as\n  young as James. We signed consent forms. Fortunately, the new machine began to stabilize James and we took\n  some of those options off the table.  During “rounds” the next\n  morning we counted thirteen doctors and nurses around James’ room to\n  get an update on his condition.  We felt like we were in the right\n  place with the right level of attention from an incredibly experienced\n  medical staff. We had tremendous support from family and\n  friends – all rallying around James and supporting us day and night. On Sunday, August 12th- just 5 days after receiving that urgent\n  call from the doctor - James started Chemo. His chemo is\n  now administered twice a day. Once for\n    30-minutes. Later in the day for 4-hours. He typically also requires a blood transfusion. This is in addition to the 18-25 drips of medication he is on\n  every hour. As crazy as it sounds, this is only part of the story over the past\n  week. There have been other challenges with blood\n  pressure, his lungs filling with carbon dioxide (CO2), scary\n  challenges switching him to new medical machinery, but tough little\n  James is making progress. On Wednesday the 15th he moved\n  to a smaller ventilator. His white blood cells are down\n  to 30,000. While still on anesthesia, James has been resting in bed with his\n  night time puppy, Curious George stuffed animal and a pacifier in one\n  hand and his favorite toy truck in the other. We have\n  been reading James books, which is very difficult while keeping your\n  emotions in check. James has a long fight in front of him. It’s scary to\n  think about all the challenges ahead but right now we are focused on\n  today. One step at a time, then we will tackle the next target. Ultimately, the only cure for JMML is a bone marrow transplant, in\n  addition to extensive chemotherapy over the coming months until we\n  find the appropriate donor match. If you want to see if\n  you would be a match for James, please register at the website below. Nearly 5,000 kids will be diagnosed with Leukemia this year. There are a lot of kids like James out there whose only hope is\n  to find a good donor match. You can do it from your own\n  home and it’s as easy as swabbing the inside of your cheek. Please visit: http://www.bethematch.org/ You can learn more about JMML at: https://en.m.wikipedia.org/wiki/Juvenile_myelomonocytic_leukemia Please keep James in your thoughts and prayers.  He’s the\n  sweetest little boy you’ll ever meet. We can’t wait to\n  hear his voice again. To see his kind blue eyes. To have him blow us a kiss with a smile. I love\n    you James. You can donate to James’ care at https://fundrazr.com/campaigns/f1OA33/pay", "url": ["https://fundrazr.com/f1OA33"]},
{"campaignTitle": "Please help fund Aimee Kelso's treatment costs", "amountRaised": ["16,670"], "goal": "of $30k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["126"], "story": "For those of you that don't know me or know me well, three\n      years and four months ago my life’s journey took a sharp turn.\n      With no real warning the ‘C’ word entered my world like a tidal\n      wave. Over the next two months I endured test after test and scan\n      after scan to determine just what I was dealing with and how to\n      treat it. We prayed, we wept, we yelled, we sat quiet, we\n      questioned, we doubted, we fought. Against the grain and advice of\n      many, I chose non-traditional treatment. This was a life-changing\n      decision. My entire lifestyle was to be changed; eating, resting,\n      processing. It was a very difficult time for me, making all the\n      changes necessary for my health and then having things change due\n      to my choice. Changing my diet and learning my new way of eating\n      was super tough; saying no to things giving myself more time for\n      rest and healing was super tough; navigating work, loss of work,\n      relationships and loss of relationships was super tough; but I did it. I am now faced with a not so new challenge...my cancer is\n        back. I have spent the last month enduring labs, tests and scans\n        to figure out what we are dealing with now. We have consulted\n        with doctors from both sides of the treatment world. It has been\n        a long, overwhelming process, but we have made a decision. So I\n        will be heading to Germany for treatment. My Rick will be with\n        me the first two weeks of what will be approximately six weeks\n        of intense treatment. This leaves our precious girls here with\n        Grandma and Grandpa for that time and a huge support group of\n        friends to bridge the gaps! I covet your prayers as I begin this\n        treatment. Protection of my girls, wisdom and patience for my\n        husband, strength and peace for my mom, travel mercies,\n        successful treatment, eradicating the cancer are just a few of\n        the prayer requests I would ask of you. Thank you in advance for\n        joining me in prayer. It is our most powerful weapon against the darkness. Psalm 46:1-7 God is our refuge and strength, an ever-present help in trouble. 2 Therefore we will not fear, though the earth give way and the mountains fall into the heart of the sea, 3 though its waters roar and foam and the mountains quake with their surging.[c] 4 There is a river whose streams make glad the city of God, the holy place where the Most High dwells. 5 God is within her, she will not fall; God will help her at break of day. 6 Nations are in uproar, kingdoms fall; he lifts his voice, the earth melts. 7 The Lord Almighty is with us; the God of Jacob is our fortress. Much love and blessings to you! aimee", "url": ["https://fundrazr.com/aimeekelso"]},
{"campaignTitle": "Please help support Avery during chemo", "amountRaised": ["1,935"], "goal": "of $2k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["40"], "story": "My son Avery was diagnosed with acute myeloid leukemia on April 25th,\n  2019 after a 6 day hospital stay. We have currently been in the\n  hospital for 15 days and have at least 3 more weeks to go followed by\n  a few days at home and more 28 day cycles in the hospital. During this\n  time I have been with Avery 23 hours a day and haven’t been working\n  while he receives chemo. I hate asking for help but during this\n  process I need to lean on my village. Anything will help keep me here\n  with Avery while we go through what is probably the hardest time in\n  our life.", "url": ["https://fundrazr.com/51UuZ5"]},
{"campaignTitle": "Please Help My Fiance To Experience Our Wedding Day In True Color", "amountRaised": ["120"], "goal": "of $349 goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["3"], "story": "Aaron is Deutan color vision deficit meaning\n      he can't distinguish between certain colors mainly red and green\n      although he does have some issues with other colors as well. I\n      would love to be able to give him the experience of seeing the\n      world in true color on our special day. WHAT IS ENCHROMA? Over 300 million people worldwide are affected by red-green color\n  vision deficiency, also called color blindness. Enchroma has created\n  glasses which enhance color vision without the compromise of color\n  accuracy. Enchroma glasses are an optical assistive device; they are not\n      a cure for color blindness. Results vary depending on the type and\n      extent of color vision deficiency per individual. The glasses are\n      estimated to be effective for 4 out of 5 cases (80%) of red-green\n      color vision deficiency – prospective users are encouraged to take\n      our online color vision test to assess the likelihood of efficacy. Enchroma does not\n      endorse use of the glasses to pass occupational screening tests\n      such as the Ishihara test. For more information please read the FAQs , learn about the Enchroma technology and story , or contact customer support . Check out these reactions", "url": ["https://fundrazr.com/01Vr9d"]},
{"campaignTitle": "Learning to Walk, Again! OUR FIGHT FOR LIFE!", "amountRaised": ["981"], "goal": "of $8k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["18"], "story": "December 1, 2012 ( World Aids Day) 終わりました。自分自身は２０年日本の皆様のためにHIVやAIDSについて必要な情報を腹をくくって全国走りまくったが。。。モ！GIVE UP! 皆聞いてないみたい！だって、日本でAIDSが増え続けてる一方！ ＊セックスゼロ世界にならないかぎり、HIVは自然に増えるけれど先進国の中で唯一AIDSが増えているのは日本だけです。 皆HIV検査しない！定期的に受けないといけないのに。。。貴方は検査した事あります？日本の全人口の１−３％しか検査経験ない、なおかつ主に妊婦さんか手術受ける方です。 アメリカの全人口の５１％が定期的に検査受けてます。 その日本だからこそ、”いきなりエイズ”って日本ならではの言い方がある。 ＊日本には世界トップレベルの治療が出来るのに入院３日後にエイズで亡くなる話は今でもある。 皆のHIV・AIDSの意識も知識も増えてない！HIVとAIDSの違いはなんですかって聞かれたら、自信を持って答える事できますか？ Q？WHAT ELSE CAN I DO TO MAKE CHANGE HAPPEN????!!!!! 自分が生まれた国ではないのに、何でこんなにバカみたいに頑張れたのだろう？自分で選んだ国だからだ！ 人生の一番大切なはずの\"LAST YEARS\"を向かうところの俺はもう限界！すでに死んでるはずだったのにまだまだ、ってか今になって脳が開き天才的な才能が現れた気がする！次の世に行ける前に終わらない事はいくつかある。ところで、困ってます。体はボロボロ！心の中空っぽ！仕事もお金も無く、少人数からの助けでまだご飯は食べてますけれど、まだまだ足りません！ 俺はこの地球に残さないといけない物があります！もしこの２０年の俺が流した汗、涙と血が無駄ではなかったら今こそ見せて下さい。もし無駄だったら、大丈夫だ！ 最終的に俺は勝手に生きるし、勝手に死ぬから。。。 ともかく、誰に何を言われようが俺は人間の為にこの地球を変えさせていただきます。 参加しませんか？ JOIN IN （・）JOY OUT J Patrick Bommarito 12/04/12 PATRICK & YAMATO Rescue Mission パトリック＆ヤマト レスキュー・ミッション 関わっていた事業が頓挫し、現在収入がありません。AIDS/ADHD/MSRA + 膝と首の関節を痛め歩行に杖が必要なほどで、外に出て働くことが難しい状態です。また、精神的にふさぎ込んでもいたのですが、次の一歩を踏み出すためにこのプロジェクトを立ち上げたという事ですが.... NEVER GIVE UP, NEVER GIVE IN! Tokyo Creator/Artist Author/Activist team Zero Cash and Homeless soon.We are sick from AIDS, Depression, ADHD, MSRA, Leg and neck damage. Immediate needs: Back rent for 4 Months RentFunds for Food, Utilites and basic house hold goods for the next 2 months. Short term needs:Funds to find and relocate.Pay medical, legal and other fees.Long Term needs include paying off all Debts and starting an NPO to help people like ourselves.", "url": ["https://fundrazr.com/bMrnd"]},
{"campaignTitle": "John And Dawn Thomas", "amountRaised": ["1,615"], "goal": "", "currencyType": [], "endDate": "", "numberContributors": [], "story": "As most of you know, John Thomas was diagnosed with colon cancer in\n  March of this year. For those of you that don’t know John, let me tell\n  you a little bit about him and his family. John is married to Dawn,\n  and they have 3 great kids, Mackensie (18), John Daniel(17), and\n  Natalie (11). All three kids attend Ouachita Christian School where\n  Dawn is an elementary school teacher. John is an occupational\n  therapist and a very talented artist. Together he and Dawn own\n  Frames-a-Plenty. You can find some of John’s art in arts &\n  craft/trade shows throughout NELA. John is a humble, hardworking,\n  kind, prideful man that I for one am happy to know. John and Dawn made the trip to MDA in Houston where he had a\n  series of scans. They met with a Dr. where they were told John’s scans\n  were clear, except for a spot on his liver.  He now has a schedule for\n  his treatments and possibly some surgery going forward. Several people have asked how can they help. If you feel lead to help\n  financially, any funds given will help to offset medical and travel\n  expenses. There are several ways to do that: 1) Go to any Bancorp\n  South location and deposit to acct : John Daniel Thomas, Jr. and Dawn\n  Thomas Benefit Acct. 2) Click the link to use credit/debit card. Thank you for all of your love and support, and I also ask that you\n  continue to pray for John. Love, Nickie Shepherd", "url": ["https://fundrazr.com/41UpE1"]},
{"campaignTitle": "Zach Branson's Medical Fundraiser", "amountRaised": ["8,988"], "goal": "of $50k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jan 2, 2020", "numberContributors": ["72"], "story": "Zachary Branson was born with a liver disease known as biliary\n  atresia. The main procedure that was performed is known as a Kasai\n  portoenterostomy. This operation connects the bile drainage from the\n  liver directly to the intestinal tract. Success of this procedure may\n  be improved when it is done before an infant is 8 weeks old. The Kasai\n  procedure is helpful because it permits bile to flow and can allow a\n  child to grow and remain in fairly good health for many years. It is\n  important to understand that this surgery is typically a treatment for\n  and not cure of biliary atresia. Ongoing liver disease is likely to\n  continue to occur even with a successful operation. Up to 80 percent\n  of children who undergo the Kasai portoenterostomy will eventually\n  need to have a liver transplant. Doctors warned that Zach would not\n  live past the age of 2 years old. Now at 30 years old, Zach has\n  surprised the medical community. He has gone through quite rough times\n  in his life growing up with this disease. His mother passed away in\n  2006 from liver and kidney failure due to alcoholism. Zach cannot work\n  a \"normal\" job anymore due to complications that arise from\n  this disease. He is currently in the process of fighting for\n  disability. The application status is pending. We are asking to share\n  this page with everyone you know. Encourage your loved ones and\n  friends to become an organ and tissue donor. If you have been blessed\n  enough in life to allow yourself to make a donation to this brave,\n  strong young man it is greatly appreciated. All funds raised will be\n  used for basic living and medical expenses for Zach in his time of\n  need. All help is greatly appreciated. Thank you ALL. <3 The following is Zach's \"Facebook Group\" where he shares\n  all kinds of information on natural health. The Files section is loaded with\n  published, peer-reviewed journal articles. Liver and Biliary Atresia - Natural\n    and Probiotic Treatments The following id the Biliary Atresia co-authored by Zach's kasai\n  surgeon Dr. John R. Lilly. Dr. Lilly was one of a handful of doctors\n  that were personally trained on the Kasai procedure by Dr. Mario Kasai himself. Biliary Atresia Registry 1976-1989", "url": ["https://fundrazr.com/ZachBranson"]},
{"campaignTitle": "Please Help - Leg amputation avoided yet slow healing recovery &many sideffects", "amountRaised": ["1,330"], "goal": "of $14.8k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["32"], "story": "We need urgent help - can you reach out to us? My name is Maria del\n  Rocio Garcia, and I have setup this Fundrazer page for my S/O\n  (Significant Other/Fiance) Thomas Ernst.  (He is German so there is a\n  summary in his language below this English text) For Mexican supporters: Find a summary in Spanish\n    here - En español aqui He was hospitalized with a\n  aggressive tissue decaying infection in his left leg below the knee\n  December 2016 with the initial diagnoses by several doctors to\n  amputate the leg above the knee. Dr. Mar Chavira at Salvatierra\n  hospital in La Paz did not share that opinion and initiated treatment\n  and procedures to rescue the limb and avoid an pending\n  amputation. The goal of this fundraising..if met...would cover\n  our medical expenses incurred so far (+/-9,500,-US $) as well the cost\n  of living / debt accumulated during the time of the illness and\n  recovery without any income and would supply the funding required to\n  find another rental moving to a better location with option to work\n  for him (+/- 5500,-US $) Please read explanation in details further\n  down and in the blog we have started. Basically we are not capable on our own power to leave the\n  sub-average lifestyle zone we are in right now and funding would\n  provide a huge help to Thomas Ernst and me assisting to restart our\n  life to a \"normal\", simple lifestyle level again. This\n  is basically \"our story\" in a nutshell. Please read in\n  detail below and may consider making a donation to allow T.E. to get\n  back to work, to manage the significant debt accumulated from his\n  battle with the infection. A donation of any kind will be greatly\n  appreciated and would be a huge help. Also, please feel free to\n  forward on the link to anyone you think might be interested in\n  supporting the cause. Please use this contact form If you have\n  any questions. Otherwise, thank you for your time and consideration of\n  this effort to help Thomas Ernst and\n  me. --------------------------------------------------- We\n  do not have a professional background to create such fundraiser pages\n  as this here in the proper way and writing. My English also has\n  severe flaws and I apologize for that. It is work in progress as\n  we been forced to change the fundraiser platform due to the\n  circumstances that prior used crowdfund Youcaring merged with GoFundMe\n  and by their policy is Mexico a Non-GoFundMe supported Country\n    and they will shut down. You find info on this here You can see screenshots of received donations during the past 2\n  weeks here on our blog . The prior campaign did not generate any support since put online June\n  2017 until Maria and a local good Samaritan, Francisco Lopez, reached\n  out at the Baja Nomads forum and made the\n  situation known at the beginning of May 2018. Them folks made already\n  a HUGE impact on our life. Having everyday \"real\" food\n  (prior eating for weeks beans & rice or Marushan), all medical\n  supplies required and having made some payments to most pressing debt\n  collectors, have electricity and communication secured. All this is\n  already a big relieve creating some breathing space. Also here\n  you find the progress in several sets of images from December 2016 on\n  until August 2017 when we had to see phone with camera used. Please be\n  aware - some of this images are VERY graphical and not for everybody's\n  stomach to view!!! Album - Gallery until August 2017 here on Google documents . We have genuinely tried during the past 18 month to progress yet the\n  combination of advancing the healing with ambulant treatment (the\n  first 6 month 2-3x per week hospital visits), the cost of medication,\n  medical supplies and transportation, basic cost of living - rent,\n  electricity, telefon, food was in dimensions to large to cope for us.\n  Ernst Thomas has no family or relatives, Maria has a small income from\n  a clerical position in a hotel working night-shifts. We have sold any valuables to create funds, we have no vehicle. Ernst\n  Thomas was still recovering from the impact hurricane Norbert and\n  Odile created 2014. ###################################################################### German Summary - E.T. ist jederzeit bereit mit Ihnen in Deutsch zu kommunizieren und evtl. Fragen zur\n  Sachlage zu beantworten! ###################################################################### Mein Name ist Maria del Rocio Garcia, und ich habe diese\n    Fundrazer-Seite für meinen Verlobten Thomas Ernst\n    eingerichtet. Er wurde mit einer aggressiven\n    Gewebeverfall-Infektion in seinem linken Bein unterhalb des Knies im\n    Dezember 2016 ins Krankenhaus eingeliefert, wobei mehrere Ärzte\n    zunächst das Bein über dem Knie amputierten wollten. Dr. Mar\n    Chavira vom Salvatierra-Krankenhaus in La Paz teilte diese Meinung\n    nicht und leitete eine Behandlung und Verfahren ein, um das Glied zu\n    retten und eine bevorstehende Amputation zu vermeiden. Das Ziel\n    dieser Spendenaktion - falls wir es erreichen koennten - wäre unsere\n    bisher angefallenen Arztkosten (+/- 9.500, - US $) sowie die während\n    der Zeit der Krankheit akkumulierten Lebenshaltungskosten /\n    -schulden und die einkommenslose Genesungzeit zu tragen und eine\n    Finanzierung bereitstellen, die benötigt wird, um eine andere\n    Wohngelegenheit zu finden, die zu einem besseren Standort mit der\n    Möglichkeit bewegt, für ihn zu arbeiten (+/- 5500,-US $). Grundsätzlich sind wir nicht in der Lage, die\n    unterdurchschnittliche Lebenstil, in der wir uns gerade befinden,\n    aus eigener Kraft zu verlassen, und die Finanzierung würde Thomas\n    Ernst und mir helfen, unser Leben wieder auf ein\n    \"normales\", einfaches Niveau zu bringen. Dies ist im\n    Grunde genommen \"unsere Geschichte\". Bitte lesen Sie\n    im Detail unten und erwägen Sie möglicherweise eine Spende, um T.E.\n    um wieder an die Arbeit zu gehen, um die beträchtlichen Schulden zu\n    verwalten, die sich aus seinem Kampf gegen die Infektion angesammelt\n    haben. Eine Spende jeglicher Art wird sehr geschätzt und wäre\n    eine große Hilfe. Bitte zögern Sie auch nicht, den Link an alle\n    weiterzuleiten, von denen Sie glauben, dass sie die Sache\n    unterstützen könnten. Bitte benutzen Sie dieses Kontaktformular , wenn\n    Sie Fragen haben. Ansonsten danke ich Ihnen für Ihre Zeit und\n    Überlegung, diese Bemühungen Thomas Ernst und mir zu helfen.", "url": ["https://fundrazr.com/gofundmyleg"]},
{"campaignTitle": "The Big Sunflower Project", "amountRaised": ["524"], "goal": "of £1k goal", "currencyType": ["Pound Sterling"], "endDate": "", "numberContributors": ["60"], "story": "The Big Sunflower Project has given away sunflower seeds since 2011\n  to raise awareness of the rare neuromuscular condtions known as\n  centronuclear and myotubular myopathy. The project aims to get as many people as possible growing\n  sunflowers each year, with seeds now being sent to schools and\n  nurseries, community groups, groups who work with disadvantaged\n  people, hospices and youth groups to name a few, so as well as raising\n  awareness of centronuclear and myotubular myopathy, the project\n  supports the activities of these groups too. Further information about The Big Sunflower Project can be found below. About the project: https://thebigsunflowerproject.wordpress.com/ How it all began: https://thebigsunflowerproject.wordpress.com/how-it-all-began/ The Big Sunflower Project on Facebook: https://www.facebook.com/groups/406061643077357/ A review of The Big Sunflower Project 2018 https://thebigsunflowerproject.com/centronuclear-and-myotubular-myopathy/http://centronuclear.org.uk/theinformationpoint/newsletters/2017/2017-02/the-big-sunflower-project.html The project does not charge for seeds or postage but admin costs for\n  the project are high and FundRazer is used to allow those who would\n  like to make a donation to do so. In 2019 the cost of sunflower seeds came to £144.40, the cost of\n  the second class large stamp which is required to post the seeds is\n  79p (£294.94 was spent on postage in total) and the cost of envelopes\n  was £22.35. Donations can be for as little as £1, so if you like what we do or\n  have benefited from the project in some way, please consider\n  supporting our work. Any funds raised via FundRazer will be used to\n  cover the admin costs of the project - stamps, envelopes and sunflower\n  seeds when it is not be possible to get these donated.", "url": ["https://fundrazr.com/a139J1"]},
{"campaignTitle": "Bone Tumor Awareness Fund", "amountRaised": ["1,268"], "goal": "of $5k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["29"], "story": "Hello family, friends, and supporters!  I am a 33-year old survivor\n  of an extremely rare bone tumor (desmoplastic fibroma), and have\n  decided to embark on a journey to create more awareness and provide\n  funding for more research for these rare tumors to help physicians and\n  patients better understand these conditions, procedures, and treatment/recovery. I am currently recovering after undergoing a more aggressive/radical\n  treatment after a 2nd recurrence of this tumor (in my right femur, as\n  pictured) to replace my knee as well as half of the femur - the\n  typical treatment for malignant osteasarcoma (my 5th operation in\n  total).  This is pretty much a testament to how aggressive and\n  grueling these tumors are, whether they are benign or not - that the\n  treatment is similar or can be identical to that of a cancerous growth\n  of the bone. These tumors happen in the 2nd and 3rd decades of life; therefore,\n  the majority of individuals enduring this pain, multiple operations,\n  and lengthy recoveries are in their childhood, teens, 20's and 30's.\n   These are ages that are supposed to be the most active, fun, and\n  joyful for youngsters and able-bodied people to be exercising, playing\n  sports, etc.  Surgeries can be extremely invasive, painful, and\n  continual. My goal is to create more awareness of these tumors that are vary\n  rare (they make up approximately 2% of all tumors) and there are only\n  about 120-200 orthopedic oncologists in the United States able to\n  treat these rare growths.  Not to mention, in major cities and\n  teaching institutions, rather than equally spread throughout - making\n  it difficult for some patients to travel to see exactly who they need\n  to see. I'd like to be able to create a community where survivors of\n  these tumors can share their experiences with one another and provide\n  support, as well as to start a fund that will benefit research toward\n  a particular body of medical science that will be dedicated to\n  learning more about muskuloskeletal lesions/tumors. For more information about bone tumors, please visit www.bonetumor.org . EVERY dollar counts.  Many\n  perks are available to select with a donation. PLEASE like us on Facebook, www.facebook.com/bonetumorawareness, and/or\n  Instagram @bonetumorawareness.  Many giveaways of great products\n  relative to orthopedics and recovery occur for members of the cause! Please visit my caringbridge.org/visit/stephaniedaly page for my\n    personal story, and for real-time updates of appointments,\n    procedures, and recovery/treatment.", "url": ["https://fundrazr.com/4khP0"]},
{"campaignTitle": "Please help Cherry get her freedom back", "amountRaised": ["2,066"], "goal": "of $19k goal", "currencyType": ["Australian Dollar"], "endDate": "", "numberContributors": ["35"], "story": "", "url": ["https://fundrazr.com/c1PmFe"]},
{"campaignTitle": "Rachel's Surgery", "amountRaised": ["270"], "goal": "of $500 goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["3"], "story": "Rachel is needing to have surgery on Thursday the 23rd. She needs to\n  travel to Dallas, Texas for this procedure. Any and all assistance is appreciated.", "url": ["https://fundrazr.com/91VPK2"]},
{"campaignTitle": "Vivre Pleinement avec Philip", "amountRaised": ["5,570"], "goal": "of $25k goal", "currencyType": ["Canadian Dollar"], "endDate": "", "numberContributors": ["91"], "story": "Bienvenue a notre campagne de financement FundRazr Nous avons besoin de vous afin d’aider Philip à vivre\n    pleinement et ce jusqu’a la fin. Vous pouvez aider Philip\n      de plusieurs façons: - En apportant une contribution monétaire, peu importe le\n    montant, afin de l’aider à rester autonome et ainsi lui donner une\n    chance de surmonter la maladie, et de vivre ses rêves ; En partageant cette campagne à vos proches, ainsi que sur vos\n      réseaux sociaux; En offrant votre temps et vos talents afin d'aider Philip a\n      rendre ses rêves réalité. Veuillez nous écrire afin de\n    savoir comment votre talent peut venir en aide; En proposant des idées de financement,\n    et d'évènements; En faisant un don financier ou autre de\n    la part de votre compagnie en échange de visibilité; _____________________________________________________________________ L'histoire a Philip MISE À JOUR Bonjour tout le monde, Ici Marie-anne, grande soeur a Philip. Je tiens a remercier du fond du coeur tout le monde qui ont\n  participé, qui participent, et qui participeront a cette campagne de\n  socio-financement. Bravo a vous tous, vous faîtes réellement une\n  différence dans nos vies (surtout celle a Philip, mais aussi pour les\n  gens qui l'entoure et qui s'inquiète). Près de 5,600$ ont été\n  ramassé jusqu'à présent! Philip reprends du poil de la bête depuis les derniers traitement de\n  chimiothérapie de cette hiver. Motivé , Philip cherche a réintégrer le\n  marché du travail pour la saison estivale, afin de rester actifs et engagé. Un petit changement d'air s'impose, nous pourrons bientôt souhaiter\n  la bienvenue a Philip, dans la capitale nationale ! _____________________________________________ Le 22 janvier 2019, Philip Simard-Léveillé, âgé de 21 ans, est\n    diagnostiqué d’un cancer de l'hypopharynx de stade 3. Malgré la\n    nouvelle, Philip garde la tête haute et les yeux pleins d’espoir; il\n    est prêt à se battre. Pour ce type de cancer, les spécialistes\n    estiment une durée de vie de 8 mois ainsi qu’un taux de réussite des\n    traitements de chimiothérapie de 30%. Pour combattre la maladie,\n    Philip a entamé ses traitements de chimiothérapie. Le type de\n    traitement qu’il reçoit se fait par intraveineuse et la durée des\n    traitements est de 12 heures par séance, toutes les deux semaines.\n    Une fois une séance terminée, celui-ci doit immédiatement se\n    retrouver en quarantaine dans un endroit aseptisé durant les 7 jours\n    suivant le traitement. Suite à l’état difficile dans lequel les effets secondaires du\n    traitement le laissaient, Philip a finalement pris la décision\n    d’arrêter ses traitements, afin de profiter au maximum du précieux\n    temps qu’il lui reste plutôt que de vivre alité et semi-conscient. Ayant perdu son travail dû au temps qu’il devait accorder à ses\n    traitements et à son isolation, Philip doit toutefois continuer de\n    manger et de payer son loyer et une inquiétude monétaire s’installe.\n    Il est crucial pour la santé mentale de Philip de garder son\n    indépendance, de rester autonome et d’avoir une vie active le plus\n    longtemps possible. Une santé mentale forte est donc extrêmement\n    importante afin qu’il puisse garder la tête haute. Positif, fonceur,\n    travaillant, combatif et attentionné, Philip a besoin de votre aide\n    afin de conserver son autonomie, mais aussi pour garder espoir. Les Fonds Les fonds que nous souhaitons recueillir pour aider Philip\n    permettront de couvrir tous les besoins de base pour une période de\n    12 mois: Loyer, hydro, nourriture, médicaments, déplacements,\n    téléphone et Internet. Afin de conserver son autonomie ainsi qu’une\n    vie active le plus longtemps possible, Philip a besoin d’amasser\n    25,000$ afin de couvrir tous les frais et dépenses qui seront\n    nécessaires au courant de l’année 2019. Une fois les frais de base\n    couverts, Philip aura la chance de se concentrer sur sa ‘Bucket\n    list’ et de vivre pleinement chaque instant. Vous pouvez aider Philip de plusieurs façons: - En apportant une contribution monétaire, peu importe le\n    montant, afin de l’aider à rester autonome et ainsi lui donner une\n    chance de surmonter la maladie, et de vivre ses rêves ; En partageant cette campagne à vos proches, ainsi que sur vos\n      réseaux sociaux; En offrant votre temps et vos talents afin d'aider Philip a\n      rendre ses rêves réalité. Veuillez nous écrire afin de\n    savoir comment votre talent peut venir en aide; En proposant des idées de financement,\n    et d'évènements; En faisant un don financier ou autre de\n    la part de votre compagnie en échange de visibilité; _____________________________________________________________________ Joignez vous a notre équipe de support Merci pour votre support! Vous fetes maintenant partie de\n    l'équipe ! S.v.p partagez afin de rendre cette campagne viral et permettre\n    a Philip de vivre pleinement", "url": ["https://fundrazr.com/91SnBd"]},
{"campaignTitle": "Jessica Russman's Liver Transplant And Stay Cancer Free Fund", "amountRaised": ["1,185"], "goal": "of $20k goal", "currencyType": ["U.S. Dollar"], "endDate": "Apr 11, 2020", "numberContributors": ["25"], "story": "Jessica and Greg Russman have approved and allowed me to run\n      this campaign. All funds donated to this campaign go directly into\n      Jesse and Greg's bank account only they have access to. Jessica Russman and I have been friends since we were kids.\n      We are more like family. I can't remember a time when I've called\n      upon her and she has not come through for me. Now SHE needs\n      assistance, and I want within all my power to be at her aide. This\n      one is going to take the Village though. Jesse was diagnosed with stage 3 liver cancer several months\n      ago and though a successful ablation the cancer was killed, due to\n      other illnesses Jesse’s liver does not regenerate. Unfortunately\n      she needs a full transplant before the cancer comes back. She is\n      currently on the wait list and unable to work. It takes all the\n      energy she can muster to spend quality time carrying for her\n      beautiful 2 year old daughter Selena. Jesse’s husband Greg is an\n      amazing man and has been her rock throughout all of this while\n      maintaining all the financial and household responsibilities. Needless to say the medical bills are piling up and becoming\n      insurmountable. The Russman’s need help to get over this mountain\n      they are about to climb? Cancer is a wicked disease that gives no\n      acknowledgement to age or personal circumstance. A liver\n      transplant is Jesse's only hope of survival. Jesse and Greg live 90 miles away from the nearest hospital.\n      So they have to stay in a hotel with Selena when Jesse has\n      treatments.  When Jesse has her transplant she will be in the\n      hospital for a month and then it will take 4 to 6 months of\n      recovery at home. They will need some in home care for Selena and\n      Jesse so Greg can work. Greg can take a leave from work to care\n      for them, but he would have to go unpaid. Any help is appreciated.", "url": ["https://fundrazr.com/JesseRussman"]},
{"campaignTitle": "Jasper's fund", "amountRaised": ["54,585"], "goal": "of $200k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["538"], "story": "The past month has been the most excruciating I have ever known but\n  within it has been Jaspers fight for life. Each day of the first 3\n  weeks had presented numerous challenges both large and small and he\n  has shown thus far that he is meeting them. He is now physically stable. Jasper suffered a major seizure the evening of 2/12/16. The\n  severity of which has left him with anoxic brain injury (this is\n  similar to a stroke). The complexity of this condition and the\n  complete unknown aspect of what lies ahead in terms of recovery is\n  what is being faced at this time. Jasper has weathered the\n  'neurological storms' that came upon him as a result of this injury.\n  These were very severe and difficult to bear. Doctors stated that\n  these \"storms\" could last days, weeks, years or never cease.\n  The absolutely wonderful news is his neurological storms have subsided\n  after less than a month and he has been slowly awakening from this state. He has begun to move both legs, move his eyes ( visual\n  tracking) and to turn his head. Very positive steps forward. He\n  responds to touch and stimuli and a few times- though not yet\n  consistent-we saw a smile......it was beautiful to see! Julianne, Jasper's mom (03/29/16) What we do know is that his recovery is going to be a long\n  road. He is facing years of rehabilitation, initially in a\n  facility equipped to deal with rebuilding his physical  and cognitive\n  abilities. This is going to be costly and we need your help . Your generous donations will be\n  used to ensure that Jasper is able to get the care he needs to reclaim\n  his life.", "url": ["https://fundrazr.com/f17Vw9"]},
{"campaignTitle": "Stan Romanek Medical /Life FundRazer", "amountRaised": ["10,670"], "goal": "of $15k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["145"], "story": "I'm adding the story behind this fund raiser so you may\n    understand who, what, when, where and most importantly why. Who: Stan Romanek is an ordinary man who experiences\n    Extraordinary events. Stan is an innocent individual who has been\n    convicted of a horrendous crime. A crime against children. Stan\n    maintains his innocence, and his friends and family stand by his\n    side knowing he would never harm a child, not even by looking at\n    pictures of abuse by others. Stan is a father,stepfather, step-Papa, husband, brother, son,\n    friend and a lifeline of understanding & support to many people\n    around the world. What: It all began in Dec. 2000 when Stan witnessed and\n    documented his first UFO. His experiences of contact with ETs/UFO's\n    still continues just not as often. More....What: Over the past 17 years Stan has endured threats,\n    physical assaults, being shot at, called a fraud and worse. Stan has also received love, praise, thanks, respect, from\n    around the world, and according to some a little fame. Netflix\n    movie, EXTRAORDINARY:The Stan Romanek Story is a documentary about\n    his life and experiences. In 2013 A detective named Koopman arrived at Stan's home with\n    a search warrant, an armed SWAT Team, and 2 persons from a forensics\n    lab. The team spent 2 1/2 hours in his home, searching. They found\n    no evidence of what they were searching for. ( What...Child Porn) No\n    disk, no jump drive, no picture, or any trace on any computer!!!! When: April 2013...search warrant When: February 2014 Stan was arrested. He spent 12 hours in\n    jail. That's how long it takes to bail someone out. When: 4 1/2 years after the search warrant, August 2017 Stan\n    was found guilty of possesion of CP by a 12 member jury. Stan does not blame the jury. They weren't give all of the\n    evidence in this case. They weren't allowed to know that Det.\n    Koopman had faced his own felony charges in 2016 for basically lying\n    to a judge in a murder case pre-trial. He was found not guilty.\n    However, the detective was placed on a Brady list. A list for police\n    officers who lie in their official capacity. No one could tell the jury about this in Stan's trial, they\n    didn't know of the other cases the Det. lied in or that there were 2\n    civil lawsuits against the detective. A lot of evidence and witnesses provided for Stan's defense\n    was not allowed or were limited in what they could say. This is not how the justice system us supposed to work.\n    Innocent people found guilty and guilty people found innocent???? Where: Loveland Colorado, Larimer County. Why: WHY DID THIS HAPPEN TO STAN?? The reason is simple. Silence the messenger! Our therory is that the evidence found 10 months after the\n    search warrant was planted. The evidence proves our therory!!!\n    Evidence not seen by the jury! How: Malicious activity!!! Virus with backdoor access, a bad\n    cop, a dark agency bent on silencing Stan, someone who simply didn't\n    agree with Stan's message of the ET/UFO reality????? Who knows!?! The end of this Story is still to be written. On October 19, 2017 Stan will appear in court for sentencing. Nothing can change that fact. The judge is a good judge, and\n    Stan's fate is in her hands. What can be done to finish this Story? Please share this\n    fundraiser. Donate whatever amount you can, and assist Stan in\n    getting an appeal. Justice for Stan is our mission. Do you Stand with Stan? #IStandWithStan PAYPAL Donations: lisaromanek@yahoo.com Thank you, blessings, love and gratitude to you all!", "url": ["https://fundrazr.com/d1HMsc"]},
{"campaignTitle": "Trevor's Top Surgery", "amountRaised": ["488"], "goal": "of $2k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["8"], "story": "My name is Trevor Clifford. I am 21 years old, and I am transgender.\n  I have been on testosterone for 15 months. Starting testosterone has\n  changed my life for the better and relieved a lot of my dysphoria, but\n  I still continue to struggle with the suffocating dysphoria of how my\n  chest looks. There are times where I wear my binder too long even\n  though I know I shouldn't, but the anxiety and grief when I take it\n  off is sometimes too overwhelming. Early on I would bind incorrectly\n  without realizing the danger of that. Due to that my sternum has gone\n  inward. Getting Top surgery will relieve a lot of my dysphoria, and\n  help me from continuing to harm my body. I recently received the best news of my life, which is getting top\n  surgery. My surgery date is April 18th. Although my insurance is\n  covering a lot of my surgery I will not be able to go back to work for\n  4-6 weeks after. I am currently working and going to school. I do not\n  live with my family, or have the support from them. My biggest concern\n  is that I won't be able to pay the bills I have since I will be out of\n  work. I have added up the total cost of two months of bills as well as\n  added in the cost of follow up appointments for surgery to get the\n  amount I need to reach by my surgery date. I have saved as much as I\n  could and I will continue to save until the day of the surgery. I'm\n  currently working two jobs to insure that I can cover my current bills\n  while I also go to school. I greatly appreciate any help I can to get\n  this life changing surgery.", "url": ["https://fundrazr.com/b1STVc"]},
{"campaignTitle": "Road to Healing: Help Col with treatment and life!", "amountRaised": ["9,349"], "goal": "of $42k goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["95"], "story": "A Message from Maria ... When I picture my friend Col, I envision light—a beautiful, warm,\n  loving light. Her aura glows with this willingness to understand and empathize. That’s one of the reasons why this disease she has been battling is\n  so difficult for me to come to grips with. It seems to be literally\n  eating away at the insides of her physical body, and yet her mind and\n  her spirit still keep glowing—still keep pushing on—despite the daily\n  obstacles she faces. Col does not like to complain so she doesn't want us to list all of\n  her symptoms, which are many. When you see her smiling and laughing\n  with you, she's doing it amidst great pain and discomfort. Often it\n  feels like she's dying. A number of her doctors don't take insurance and need to be paid out\n  of pocket (just one office visit can cost $600!) and the treatment\n  they prescribe is also not covered by insurance. She has been sick for\n  numerous years so you can imagine the toll that that takes. Her illness is not something you'd know about unless you are close to\n  her. But it's very serious and it severely impedes her quality of\n  life. And her closest friends and family are very concerned— *We want her to be with us for years to come!* Please join me in doing what you can to help Col win this war within\n  her body and pave her road to healing. A Message from Sue Elliott ... Have you ever met somebody — even online — and instantly loved that person? I’m not talking about lust. I’m not even talking about appreciation. What I mean is some sort of deep, soul-level recognition. A\n  feeling like “home,” like “It’s so good to see you again after all\n  these years! I do so adore you!” That’s how I felt about Col the first time I saw her photo and\n  read a comment she had posted online in a business-oriented group\n  years ago. Since then, I’ve gotten to know Col “better,” and I still have\n  that same feeling. She’s like a cross between an angel, a friend and a sister! We have amazing conversations in which we both let go of all\n  kinds of “stuff” that no longer serves us and we experience huge AHA moments! If you had asked me a year or so ago how I felt about Col, I\n  would have told you that she’s a dear, dear friend, at the very least. And yet, as close as we had gotten on so many levels, I\n  had NO idea that Col was often in severe physical pain. Not only does she not complain about pain, she’s so genuinely\n  joyful and inspired and inspiring, it never dawned on me that she\n  could be anything but energetic and “healthy.” Her very being exudes well-being! Col wrote a beautiful blog post that illustrates her approach to\n  life and living, even in the midst of pain... even in the midst of\n  illness. Please take a couple minutes to be inspired by the beauty of\n  Col’s approach to — and dance with — life: Dancing in the Rain . Throughout the pain and the illness, Col has been giving to\n  others in the most magnificent way. She created a FREE program called Magical Medical Mystery Tour , in which she\n  interviewed amazing healers of all kinds. She created a forum in which\n  these experts shared their wisdom freely with anyone who cared to\n  participate. The gift of these interviews continues to unfold within\n  me and, I’m sure, within all who were game for the adventure. So when Col told me that she now has one or two Western medical\n  doctors for EACH of her organs! —and as much as she loves and\n  appreciates them, Western medicine doesn’t seem to be working for her\n  particular illness — I didn’t have to ask if she had tried natural and\n  alternative healing modalities. I knew she had — with joy and\n  enthusiasm and insight ... And yet, her body still has more to say — more insights to\n  reveal — and it wants to reveal those insights and that wisdom through\n  biological medicine. Col has received many “nudges” from the universe\n  pointing her in that direction — and this is a woman who KNOWS how to\n  listen to and dance with the universe. Like all great dances, it’s a two-way experience. There is\n  giving and receiving. And there is constant expansion. One of the most obvious — and magnificent — benefits of this\n  expansive dance with the universe and with pain and illness has been\n  creativity. Everything that Col learns and experiences goes deep\n  within her being and comes out as ART! Art with spirit. Art with soul. Art with purpose. And art that\n  is infused with the energy of healing and a return to balance and wholeness! If you feel inspired, I encourage you to listen to your soul.\n  Listen to your body. Listen to your inner response to Col’s artwork.\n  And if something resonates deeply within you, please purchase it. Not only will you be bringing something beautiful and powerful\n  into your own home or office, you will be helping to make Col’s dream\n  come true, the universe-directed dream to receive biological treatment. I know I will be buying several pieces of Col’s work for myself\n  and to give as gifts. And I know I will not be alone. Col is so loved\n  by so many! Sue Elliott Founder/Editor-in-Chief of Law of Attraction Magazine www.LovingMyself.com .................................................. Here's what your donation will be used for .................................................. Phase One: $6,000 Address heavy metal poisoning, remove mercury amalgams,\n    including exam, testing, IV, conscious sedation, post-op meds and at\n    least a full year of chelation (then retesting and more chelation,\n    if required). Phase Two : $36,000 Research-based holistic treatment plan prescribed by an\n    M.D. who specializes in complex illness and an extensive stay at a\n    treatment center like Paracelsus or The American Center for\n    Biological Medicine including testing, treatments and medications. Ongoing: Life! Col has been unable to continue working and has needed to\n    instead focus on her healing so your support will enable her to\n    create the space to do this. Thank you! .................................................. PS: Contribute any amount you like. Just click the sunny-orange\n  \"Contribute\" button on the upper right or the\n  \"Contribute\" link below. Either choose a perk or select\n  \"No thanks, I just want to contribute\" to type in a\n  customized dollar amount. Thank you for helping!", "url": ["https://fundrazr.com/HelpColHeal"]},
{"campaignTitle": "Please Help Us With Dad's Pancreatic Cancer Chemo Costs", "amountRaised": ["1,670"], "goal": "of €37k goal", "currencyType": ["Euro"], "endDate": "", "numberContributors": ["47"], "story": "A few weeks ago, my father, Florin, was diagnosed with stage 3\n  pancreatic cancer at the head of the pancreas. For those who don’t\n  know us, I’m Laura, I have a sister and a brother who’s 11 years old,\n  so still only a young kid who doesn’t fully understand what is\n  happening with our father’s health. We are all desperate and worried\n  and have started this fundraising campaign to ask for your help and\n  kindness, to be able to cover our father’s chemo treatment costs. We\n  can’t even imagine living in a world where our father is no longer\n  there and even writing this down makes my hands shake. For us all, this terrible news has come as a shock, we couldn’t\n  believe something like this could happen to him. I saw him first on\n  the 13th of February after my last visit home in October, and I felt a\n  knot in my throat. He had just had a stent inserted to help with the\n  jaundice and the tall, imposing, well build man I’ve always known him\n  to be was then skinny and grey skinned. Since then, he’s looking much\n  better, gained back a healthier color in his cheeks, he’s got a\n  healthy appetite and he’s feeling hopeful and determined to get better. At the moment, the tumor they found is a huge 45 millimeters\n  adenocarcinoma and is not operable. Thankfully, a chemo treatment\n  available in Vienna could improve his life chances, hopefully\n  shrinking the tumor down, making it operable. Last week, doctors\n  advised treatment should start immediately as there is no more time to\n  waste and the healthcare standard available in Vienna is the best\n  available option for my dad’s prognosis. On the 1st of March, he\n  started his first round of chemo with Abraxane and Gemzar. Each chemo\n  session is charged at 3700 euros and the cost is estimated at around\n  37.000 euros for the first few months of treatment. Right now, we’re\n  taking it step by step, though in the near future, under the\n  circumstances, we do not know how we will be able to afford treatment\n  anymore. It’ s widely known that pancreatic cancer is one of the most\n  aggressive types, but if anyone can come back from this, I know it’s\n  our dad. He has always been a strong, optimistic man and continues to\n  be so even under the circumstances. He is willing to do and try\n  everything possible to fight this, but we do need help to see him\n  through. Please, as far as possible, help us get there! Any donations\n  can help us get closer to saving dad. We will forever be thankful and\n  grateful for your kindness! .......................................................................................................................... Cu câteva săptămâni în urmă, tatal nostru, Florin Mateescu, a fost\n  diagnosticat cu cancer pancreatic, stadiul 3 la cap de pancreas.\n  Pentru cei ce nu ne cunosc, sunt Laura, am o soră și un frate care are\n  11 ani,  încă un copil, care nu înțelege pe deplin ce se întâmplă cu\n  sănătatea tatălui nostru. Suntem cu toții disperați și îngrijorați și\n  am început această campanie de strângere de fonduri pentru a cere\n  ajutorul vostru și a face apel bunătatii voastre, sa putem acoperi\n  costurile de tratament pentru tata. Nici nu ne putem închipui să trăim\n  într-o lume în care el nu mai este și numai scriind aceste randuri,\n  imi tremura mainile. Pentru noi toți, această veste teribilă a venit ca un șoc, nici acum\n  nu putem crede că așa ceva i se putea întâmpla lui. Pe 13 Februarie,\n  prima dată când l-am văzut pe tata de la ultima mea vizită in Romania\n  din Octombrie, am simțit un nod în gât. Tocmai ce ii pusesera un stent\n  pentru a controla icterul, arata slab, cu pielea de o culoare cenusie.\n  De atunci, se simte mult mai bine, are din nou o culoare sănătoasă în\n  obraji, un apetit sănătos și se simte plin de speranță și hotărât să\n  faca tot posibilul sa se insanatoseasca. Tumoarea pe care au descoperit-o este un adenocarcinom de 45 de\n  milimetri și care, deocamdata nu este operabil. Din fericire, un\n  tratament cu chimioterapie disponibil în Viena ar putea să-i\n  îmbunătățească șansele de viață, sperând că o sa scadă tumoarea,\n  devenind operabila. Săptămâna trecută, medicii au recomandat ca\n  tratamentul să înceapă imediat, nu mai este timp de pierdut, iar\n  standardul medical disponibil în Viena este cea mai bună opțiune\n  disponibilă pentru tratarea tatălui meu. La 1 Martie, a început prima\n  rundă de chimioterapie cu Abraxane și Gemzar. Fiecare sesiune de\n  chimioterapie costa 3700 de euro, iar costul este estimat la\n  aproximativ 37.000 de euro pentru primele luni de tratament. In\n  momentul de fata, o luăm pas cu pas, deși în viitorul apropiat, în\n  aceste circumstanțe, nu știm cum vom putea să ne permitem continuarea tratamentului. Dupa cum se bine stie, cancerul pancreatic este unul din tipurile\n  cele mai agresive, dar dacă cineva poate reusi in lupta asta, știu că\n  acea persoana e tată. El a fost întotdeauna un om puternic, optimist\n  și continuă să fie la fel chiar si în aceste momente. Este dispus să\n  facă și să încerce tot posibilul pentru a lupta împotriva acestui\n  cancer, dar avem nevoie de sprijinul vostru. Vă rugăm, pe cat posibil,\n  să ne ajutati, orice donație ne poate aduce mai aproape de a il salva\n  pe tata. Va vom fi pentru totdeauna recunoscători pentru bunătatea voastră!", "url": ["https://fundrazr.com/c1TAWc"]},
{"campaignTitle": "Help Jaxson get colorblind glasses", "amountRaised": ["165"], "goal": "of $349 goal", "currencyType": ["U.S. Dollar"], "endDate": "", "numberContributors": ["7"], "story": "Help Jaxson See The World In Color! Jaxson will turn 8 in May of 2019.\n      He is color blind. He has strong proton color blindness. This\n      means that his red cones don't detect enough red and are too\n      sensitive to greens, yellows and organs. As a result, greens,\n      yellows, oranges, reds and browns appear the same especially in\n      low light. He also has difficulty telling blues from purples and\n      pinks from grays. Jaxson is a sweet kid and is well adapted to having color blindness\n    but it does make somethings more difficult. You really take for\n    granted how much you rely on seeing color. There are many common\n    things that Jaxson struggles with: picking out clothes that match,\n    finding the right color of LEGO while building a kit, seeing print\n    on a colored background, and even seeing his bobber while fishing. I took him to try the color blind glasses out because he told me\n    that he just wanted to see what the world was really like. He\n    described seeing colors for the first times as amazing and\n    mind-blowing! He told me that he saw colors that he never saw before\n    like red, purple and pink. He told me that he doesn't want me to get him the glasses because\n    he is okay with how God made him and he doesn't want me to spend\n    that much money on him. I would like to get him these for his\n    birthday so that he doesn't feel as if we are spending tons of money\n    on him. His lenses will cost about $469. This is the cost with the frames.\n    We are hoping that insurance maybe able to cover the frames.\n    Insurance will not cover anything for the lenses. Please help us let Jaxson see the world in color! WHAT IS ENCHROMA? Over 300 million people worldwide are affected by red-green color\n  vision deficiency, also called color blindness. Enchroma has created\n  glasses which enhance color vision without the compromise of color\n  accuracy. Enchroma glasses are an optical assistive device; they are not\n      a cure for color blindness. Results vary depending on the type and\n      extent of color vision deficiency per individual. The glasses are\n      estimated to be effective for 4 out of 5 cases (80%) of red-green\n      color vision deficiency – prospective users are encouraged to take\n      our online color vision test to assess the likelihood of efficacy. Enchroma does not\n      endorse use of the glasses to pass occupational screening tests\n      such as the Ishihara test. For more information please read the FAQs , learn about the Enchroma technology and story , or contact customer support . Check out these reactions", "url": ["https://fundrazr.com/01UhUc"]},
{"campaignTitle": "Can you hear that sound? Well, Amirul can’t. \nHelp him hear again.", "amountRaised": ["100"], "goal": "of $7.5k goal", "currencyType": ["U.S. Dollar"], "endDate": "Jul 19, 2019", "numberContributors": ["5"], "story": "During my childhood at the age of 7, while most children run around,\n  have fun with their friends, joyfully shouting and playing. I\n  lost my hearing on my left ear. I was told by my mother, during my infancy, I had a high fever which\n  led to my loss of hearing. Because I was too young, it was hard for me to notice that I had lost\n  one of my hearing. One night, my mother asked me to call my grandpa. I used my right ear\n  to make the call. After making the call. I asked my mother. “Ma, how come people can use only one ear?” And she responded me “People use 2 ears dear.” She was surprised, that I asked such question, and asked me why I\n  asked that question. And I told her, “I can hear with only one ear ma.” That’s when my mom first noticed that I couldn’t hear with my left\n  ear, and I learned that God gave me two ears but can hear with only one. This was one of the heartbreaking times I had to go through, but I\n  tried to stay positive and be thankful that I can hear with the other ear. Both my parents worked so hard to help me get hearing aids, but it\n  wasn’t easy because it costed too much. It wasn’t easy for me but I\n  bet it was more difficult for my parents because seeing me and taking\n  few years to realize that I had this disability. Just like what every parent would do, my mother brought be to the doctor. The doctor recommended my mom to get me hearing aids. Because I was\n  young, I didn’t know how this would affect my hearing later on. At\n  first, I didn’t want to admit and get hearing aids because I didn’t\n  want others to make fun of me at school, or how people would see me. Many years passed and I was attending college that time. It was during my 3rd semester in college. It was a normal day and I was attending class. I always had\n  difficulty understanding the lessons because I couldn’t hear the\n  lectures clearly from afar, so I thought I was just in a bad condition\n  because my hearing was worse on that day. I went back and slept in early that day. On the next day, that\n  was the day. That was the day I’ve completely lost my hearing. I thought everything was just quiet and I woke up to early. It\n  wasn’t. I lost both of my hearing on that day. Only God knew what I felt that time. Most of my close friends knew that I have a hearing problem, but they\n  didn’t knew that it was getting worse. Because, I had to continue my studies. I had to shrug everything off\n  and continue attending class. It was very difficult for me, but my friends were there to comfort me\n  and support me. Despite their support and comfort, I wanted to give up because I\n  still had 2 semesters left, and it was all too overwhelming for me. I couldn’t hear anything the lecturer was talking about during class. In frustration, on that evening, I was alone in my room, and in the\n  dark, I cried in the dark alone. I pushed everyone away from me because it was too hard for me to\n  accept everything and place my friends in difficult situations, I\n  didn’t want to make it hard for them. Few days have passed and it was getting more difficult for me, so I\n  had to call my parents. I’m originally from Sibu but was studying in Kuching. I called them,\n  but I couldn’t hear anything, I tried so hard to hear and raise the\n  loudspeaker volume to the max. I could only hear little sounds but I knew my mom was crying, we all\n  cried that night. My mom prayed really hard and tried to support me\n  the best that she can. Seeing my mom working so hard to support me gave me the strength. I tried to think positive. During class, I wrote down all my\n  notes by copying notes from my classmates. I read everyday and studied as much as I could. Imagine studying with both of your ear closed. It was one of the most\n  hardest part of my life. I studied really hard and surprisingly passed all my courses for that semester. My mom worked really hard and saved up enough to get me basic hearing\n  aid. Since the hearing aid was too expensive my mom could only afford\n  to buy me one piece of hearing aid for my right ear. On my 4th semester, that’s when I started hearing again. Though it\n  was only my right ear, I was so thankful that I could hear little by\n  little again. I finished my associate degree and now I’m working as a contractual\n  employee, I try hard to work but because of my hearing, It was hard\n  for me to find a job and people to take me in. I went to the hospital to check my hearing progress and the doctor\n  told me, my hearing has deteriorated and I need to get a better one,\n  because we could only afford the basic hearing aid. I try to work as hard as I could for the present and for the future\n  but sometimes, my efforts are not enough because capabilities are\n  limits because of my hearing. My mother worked so hard to help me get this basic hearing aids, but\n  our family is on a tight budget to pay off the dues, my sisters\n  education fees and living expenses. This is my last hope, please help me hear again. The hearing aid’s costs 7500usd, but this is a huge amount of money\n  for our family though we work hard, it would take us years to pay off\n  this amount. This is my last wish. I want to hear again so, I can work better and\n  support my family. Both my parents are old and still working to\n  support us and pay off the dues. Your help would be highly appreciated no matter what amount it would be. Thank you for spending your precious time to read my story.", "url": ["https://fundrazr.com/71UYk9"]},
{"campaignTitle": "MAY the 4TH  be with you Michael Bacon !", "amountRaised": ["2,585"], "goal": "of $5.5k goal", "currencyType": ["Canadian Dollar"], "endDate": "", "numberContributors": ["25"], "story": "APPEAL FROM SUZIE McNEIL It was in December that my good friend and manager Michael Bacon\n  injured his right leg with partially torn quad tendons and his left\n  leg with a small ankle fracture and a strained Achilles heel. With injuries to both of his legs simultaneously he was rendered\n  unable to walk and admitted to Trillium Hospital on December 23 where\n  he spent the Christmas holidays with close friends and family visiting. After spending over 28 days in the hospital for pain management,\n  Michael was transferred to a long term care facility, commonly known\n  as nursing homes, for Restorative Rehabilitation at the Cooksville\n  Care Centre across the street from the hospital. Michael found it funny that his mother is 83 years old, has had a\n  walker for years, had her knee replaced almost 2 years ago, both\n  cataracts just operated on, and he beat her to a nursing home! Michael spent the last 3 months at the facility recovering and\n  restoring his strength through ongoing daily physiotherapy.  He now\n  can walk with the assistance of a walker and has just been released to\n  return home to continue his recovery. I visited Michael at both the hospital and the nursing home and saw\n  how difficult it was to see him confined to a hospital bed and only a\n  wheelchair to get around for months, so seeing him walk with a walker\n  is encouraging and I know he will fully recover. Unfortunately, being incapacitated for 4 months has put a toll on his\n  finances as it would anyone not being able to work and having to put\n  his business on hold.  On top of the loss of income is the expenses of\n  the drugs, crutches, braces, boot cast, wheelchair, walkers, and\n  ongoing physiotherapy which have added up considerably. As friends and family know Michael is always the first to offer his\n  help when someone is in need, and has helped many musicians, friends\n  and audiences enjoy live music together over the last 20 years in the\n  music business. So to thank Michael for all of his hard work and generosity I decided\n  to rally some support so I put together this FundRazr account and will\n  host a fundraiser concert with many of the musicians Michael has\n  worked with over the past 20 years.  Everyone was excited to be a part\n  of it and we have an exceptional lineup of great musicians who are\n  donating their time and talent to this great event. May the 4th be with you Michael Bacon! Featuring Suzie McNeil – Stacey Kay - Gord Deppe & Sandy Horne from\n    the Spoons Jordan John – Tyler Yarema - Tom Barlow - Gracie Chuck Keeping – Peter Kadar and many more surprise guests! Saturday, May the 4th 4:00 -8:00 pm Shore Grill & Grotto 71 Lakeshore Rd E. Mississauga, ON It’s going to be one hell of a show and tickets are only $20 and will\n  go fast so get them while you can. For advance sales, email the number of tickets required to maythe4thbewithyoumb@gmail.com For those who are unable to make it the fundraiser\n  concert, we encourage you to contribute what you can to this\n  FundRazr account to help make this event a great success and get\n  Michael back on his own two feet again.", "url": ["https://fundrazr.com/maythe4thbewithyoumb"]},
{"campaignTitle": "Please Help Us Support Bob's Recovery", "amountRaised": ["4,985"], "goal": "of $25k goal", "currencyType": ["Canadian Dollar"], "endDate": "", "numberContributors": ["26"], "story": "HELP BOB GET HIS PROSTHETIC LEG, GET OUTDOOR WHEELS AND MOVE\n    TO A WHEELCHAIR ACCESSIBLE APARTMENT We have collectively started this fundraiser for Bob; our Dad,\n    Grandpa, Cousin, Partner and Friend who is living with diabetes and\n    is now facing his third amputation. Over the past 6 years, Bob’s health has declined dramatically\n    going from managing through diet to PD at home 24/7, to in and out\n    of ER, being admitted on and off to his recent amputations. The disease is currently expressing itself with acute renal,\n    liver failure, high blood pressure and debilitating vascular\n    cognitive as well as peripheral artery disease. In November 2018 Bob\n    endured two amputations, first a toe which didn’t heal then soon\n    afterwards, the below the knee amputation. Bob is now facing the amputation of his other leg which will\n    cause us to have to move again. The Fundrazr funds will be managed in a trust. For all the details\n  about Bob's budget and health challenges please scroll to the end. Read on for Bob's story and letters from our family... Please help us help Bob . In the next 1- 6 months, he’s facing new costs for a Prosthetic\n    leg, outdoor electric wheelchair (his current one is ok indoors but\n    can’t go up a hill or keep up with someone walking slowly), a move\n    to a wheelchair accessible apartment, payments on a van with a lift\n    and the ever increasing list of medications that are not covered.\n    We’re posting the details of upcoming expenses below. All\n    contributions will be going into a trust managed by our friend and\n    lawyer - Amanda Rose. We’ll be posting photos and Amanda will be\n    posting updates on how the funds are used. Bob is still hopeful to\n    eventually recover from current challenges in order to meet the\n    requirements to undergo the kidney transplant. The costs and debt have been piling up and it’s overwhelming.\n    Bob's close circle of family has been helping and his partner Fitu\n    is working 3 side jobs plus her F/T position as a site resident\n    manager, allowing her to care for Bob at home. Until now, we’ve all\n    been pretty quiet about this but it’s just not possible anymore. Any help you can offer will be a\n    huge help - whether it’s making a donation of any size, commenting\n    below, sharing Bob’s story in person, on the phone, in email or\n    social media. Let’s get Bob’s story to everyone who knows him on the\n    BC coast and beyond. BOB’S STORY Those of you who are lucky enough to share in Bob’s life, you\n    know it’s an adventurous one. Fisherman, Father, Friend. Family. Bob\n    was born on February 2nd, 1956 and grew up in Burnaby while he spent\n    his summers fishing in Alert Bay. As a kid, Bob was fortunate to be invited aboard to join the\n    crew on the Cape Cook by Gilbert Cook Sr.. Eventually young Gilbert\n    took over and he stayed for a few seasons. Bob also crewed salmon on\n    the Jean W., Bruce Luck, Good Partner and the Sleep Robber. He also\n    fished herring on the Jean W, Dawn Treader and Waverley. Bob says,\n    “I ran the Sea Castle and a few other gillnetters. I can’t recall\n    the names but that is just where my brain is going…” Whether on land or water, Bobby is a hard worker. He takes\n    utmost pride in caring for his family, his children and\n    grandchildren: the loves of his life.  He’s the Bob of all trades,\n    and well, master of them, too. While on land Bob is a painter and a\n    carpenter and has done repairs, maintenance and renovations from his\n    own apartments to large condo complexes. He’s known for his\n    attention to meticulous detail...everything must be totally squared off! While on the water, Bob is in his element. Happy, working hard,\n    visiting and laughing with people on other boats,  telling stories\n    and fooling everyone with his jokes - always delivered as true\n    stories with a straight face! FITU & BOB  - OUR CONNECTION Mine and Bob’s long history began with our grandparents.  Our\n    grandfathers were seine fisherman from Alert Bay. Our grandmothers\n    were best friends who raised their children together in a small town\n    and later moved to Vancouver as their families grew in numbers and\n    age so they could attend school in the city. Our mothers remained friends throughout their lives and raised\n    their children together. Bob and I grew up together, always friends.\n    We both went our separate ways, married others and raised our\n    children only seeing each other at various family events or during\n    the fishing seasons. In 2009, both single, our paths met again; this\n    time we brought with us our huge mixed bag of beautiful children.\n    Now after 11 years, our family includes grandchildren from our kids\n    and our closest friends. As you can see in the photos, the kids are\n    Bob’s joy and they feel the same way. Dad, love you from Courtney – Honestly, I am not\n  really sure where to start. Not a single day passes by that I don’t\n  think of you, even though I don’t see you as often as I would like.\n  Bey, Maddox, Laila and I miss you daily and wish we lived closer so we\n  could spend more time with you. You have always been the “rock” in my\n  life and I just want you to know that if I lived closer, I would\n  strive to be the “rock” in yours. You entered my life when I was a baby and even though I was not\n  biologically your child, you always treated me as though I was. You\n  raised me as though I was your own and I never questioned that I\n  wasn’t (besides wondering why my hair was dark and Britt’s and Nick’s\n  was blond LOL). Even when I learned that you weren’t my biological\n  father, I never felt that you were anything other than my dad. YOU\n  were the one who helped teach me to walk, talk, ride a bike, drive,\n  etc. Through every milestone in my life, YOU were there. YOU were my rock. Some of my best memories are the times we spent on the fishing\n  boat. Bringing in the nets, playing with sea creatures, scrubbing the\n  decks and beautiful sunsets taught me more about life then you will\n  ever know. Seeing killer whales so close to the boat we could touch\n  them was such an amazing experience that has remained in my mind all\n  these years. Although the large storms and trying to find other boats\n  to tie up to were scary as a child, you always made us feel secure and\n  safe. I wouldn’t trade these memories in for the world. I know my teenage years were not easy for anyone, but you\n  handled them like a champ. I was a terrible teenager, but you NEVER\n  treated me as such. The nights of me failing to come home, my\n  dishonesty, and the many bad decisions I made never changed the way\n  you treated me or felt about me. One of your best attributes is that\n  you NEVER judge people. Many times during this rough time in my life I\n  felt judged by people but never by you. No matter what I did or didn’t\n  do you were always there. I remember the many times you came to find\n  me and when you did, there were no questions asked. No judgement. No\n  yelling. You accepted me as I was and never pushed me away. I could\n  tell you anything without fear of judgement or being in trouble. I\n  want you to know that without your support during this time, I am not\n  sure that the outcome would ended up as good as it did. Again, you\n  were always my rock. It is because of your support that I am\n  where I am today – happily married with 2 wonderful kids. Bey\n  considers you as a father and has the utmost respect for you. Maddox\n  and Laila ask about grandpa all the time. They always ask how grandpa\n  is doing and when he will come down to visit next. Maddox especially\n  understands what grandpa is going through and is so empathetic and\n  helpful it amazes me. We all understand this time in your life has taken a physical\n  and emotional toll on you. Like you always told me “life isn’t easy”.\n  You have so much support and love that if we all work together, we can\n  help make your “new” life as easy and enjoyable as possible for you. I want to say thank you to Fitu. I know this has also been\n  physically and emotionally hard on you as well. Dad is extremely lucky\n  to have you in his life. The amount of time you dedicate towards dads\n  care is incredible and you do it all without any complaint. I know you\n  are his “rock”. You are one of the most selfless people I know and\n  from the bottom of my heart, I appreciate everything you have done and\n  continue to do for my dad. My rock. For Dad, love Brit - I often reflect on the\n  continuous presence you have in my life – the days, weeks and years\n  through which your duty as my father has brought nothing but pure\n  enjoyment. You are a support of strength, encouragement and\n  discipline. Your love is endless - you are a man to be admired. From a young age, I can remember the many hours you spent\n  playing with me, the thousands of kisses goodnight and the countless\n  trips out for meals when dinner on the table was “questionable”. I\n  recognize the moments for which you were and are there – no matter the\n  sacrifice. You give me all the love, time, care and appreciation that\n  you have available. I am grateful for the countless phone calls and\n  advice given when I have no one else to turn to. As though it was yesterday, I remember you gifting me my first\n  car and shortly after that helping me shop for the car of my dreams.\n  Truth be told, I had no idea what the process entailed and was a\n  little overwhelmed in the moment, but as with every other milestone in\n  my life you held my hand and walked me through it all. By the end of\n  the day, I had a car of my own and the freedom to take me where I\n  needed to go. That freedom took me to university, where you continued to\n  provide your infinite support of home cooked meals and a roof over my\n  head, albeit not always with walls. The day I graduated your sported a\n  look of “honored father”, one that boasted how proud you were of me\n  and shouted to the world that you had all the confidence and trust in\n  it to guide me through to the next journey in my life. Not many years after that, you waited (not so) patiently outside\n  of my delivery room where you were blessed with one of the most kind,\n  loving and caring little boys you will ever have the pleasure of\n  knowing. I knew right away that the bond between you two would be\n  special and that your firm and gentle touch was as loving as could be.\n  Again, those tears in your eyes told me just how proud you were of me\n  in that particular moment in time. From there we traveled to Los Cabos where you met me in my suite\n  to walk me down the aisle on my wedding day. Neither one of us knew\n  what to do, how slowly we should walk, where we should look or how to\n  link arms, and just like that the moment flew by. We got to the\n  gazebo, you blinked back tears and you couldn’t say a word. The\n  message was clear – you were proud. Each of the milestones mentioned above, along with many more\n  occurred as I transitioned from a child to an adult. Each symbolized a\n  moment when I needed to be guided in order to grow. Your loyalty,\n  confidence and unconditional support has moved mountains in my life,\n  and there are still mountains left to move, so don’t think for a\n  second that your job is done! I need you in the years ahead, and to\n  play your role with fineness. I need you more than ever. I often reflect on the continuous presence you have in my life –\n  the days, weeks and years through which your duty as my father has\n  brought nothing but pure enjoyment. You are a support of strength,\n  encouragement and discipline. Your love is endless - you are a man to\n  be admired. From Jojo Our Creature As Carson’s’ nanny, I serendipitously, etc. etc. etc. met Bobby\n  April 2016. I was the last to know there was an existing established\n  relationship between my “ward” and Bobby and Fitu. Why are these\n  people cooing over my sweetie pie in the elevator? How do they know\n  his name? Why is my sweetie pie responding so lovingly to these\n  strangers? Thank you, Bobby for… (loving Little as his own / loving me\n  as his own.) One random Tuesday, this familiar stranger Bobby invited me and\n  my sweetie pie to spend the day at the beach, which happen to turn out\n  to be the first of many. I am Jody, but I happily spent many warm, sunny beautiful days\n  as “Brittany” while our sweetie pie vacillated between being Carson in\n  flesh and nostalgically baby Linden. Other times our sweetie pie was\n  Baby Nick, other days he was Maddox. Some days I was Courtney. We sure\n  had to keep an eye on curious Baby Wayne! I hadn’t yet met Bobby’s\n  children, but I felt a comfortable closeness to each of them. I knew\n  and felt Carson and I were safe and loved with this familiar\n  stranger…the three of us journeying through time and space Jody and\n  Carson, and Wayne and Courtney and Brittany and Nick and Skye and\n  Maddox and Laila and Linden loved up and safely kept by Bobby, their\n  Father, their Grandpa…this familiar stranger, my friend. As Summer turned to Fall things got real: Bobbly learned\n  feminism and Jody learned to bite her tongue. Let’s face it, social\n  graces between Bobby and I fell quicker and more plentiful than the\n  autumn leaves. I gifted Bobby with the privilege of gender politics\n  and all that is Feminism. I was gifted in return with the ins and outs\n  of Republicans. Poor Fitu had to share her own living room with Fox\n  News and Bobby and Jody and our thoughts Hawkins cheesies and our\n  opinions and for some reason I don’t think either Bobby or I kept\n  things to a dull roar. From Deb - Meeting you “My Bob” (as my kids call you\n  ) 6 years ago , we would never have imagined what a great influence\n  you would have on our life. All the time you spent with my girls especially Iylah who came\n  out of her shyness so quickly with you and Fitu, coming over when our\n  sink flooded in the middle of the night , helping me scrape paint off\n  my window sills due to my lousy painting ability, bbqing us chicken\n  burgers, being my go to guy when it came to a lot of things and so on.\n  You will never know how much I appreciate everything you’ve done for\n  us. You are a perfect example of a wonderful Grandpa , Dad and\n  friend is and we are lucky to call you family. Our love for you\n  is immense and we adore and support you always! Deb From Amaya - I don’t even know where do begin. You\n  are awesome all around I wanna say thank you for everything you’ve\n  done for me, my mom, and my sisters. I know it may seem I don’t\n  acknowledge anymore lol but know I love you and appreciate everything\n  you’ve done for us From Zaida - My Bob there are no words that describe\n  how much I love you. You have always been there for me like a dad and\n  I can’t thank you enough. Thank you for all the chicken burgers,\n  wheelchair rides, babysitting, and so much more. Know that I am always\n  here for you cause you were always there for me. Love you. From Iylah - My Bob. I love you so much you were the\n  best babysitter ever I miss seeing you every day and cuddling in the\n  lobby with you. You always make me laugh and I wish I didn’t\n  have to go to school so I could hang out with you more Thank you\n  for always being there for me love you Thank you for reading, caring,\n    helping, sharing and being part of Bob’s story! We also want to say\n    that although we’re facing another crisis, we’re grateful for all\n    the love and support - time and money - so far. As can be well imagined, Bob’s life has made dramatic shift. We\n    are so proud of all our children, grandchildren, friends and family\n    who have joined us in this ever changing journey, it has certainly\n    been challenging and enlightening. We’re very grateful to our huge\n    mixed bag of kids, brothers Kevin and Doug, their wives Carolyn and\n    Sue, Aunt Carol, Uncle David,  Aunt Marni and Uncle John as well as\n    friends that were available to visit, offering their loving support\n    both emotionally and financially. The grandkids have especially been awesome! They’ve displayed\n    loving curiosity while being very patient, never, ok rarely whining,\n    complaining or acting out. Love you all tons and we are so blessed\n    to have you all Skylar, Maddox, Linden, Mikhail, Giaan, Carson and\n    our beautiful Laila.  To the eldest; Sky you display such absolute\n    amazing character for a 16 yr old young man, how you help, play and\n    patiently care for the young ones. Mikhail, your FaceTime and\n    pictures from the other side of the world are heartwarmingly\n    precious, we are grateful. All of the parents have done a fabulous\n    job helping the ‘lil ones navigate this difficult time…. you have\n    all done well considering the situation. The grandones don’t fully\n    understand what’s happening although for the youngest ones, it’s the norm. I am especially grateful to my assistant/friend Deb for her\n    constant reliability and devotion, and to her 3 amazing girls, who\n    all refer to Bob as “their Bob”. Deb has been instrumental in\n    allowing me to devote so much of my time to being there for Bob. DLL, as always thank you for your ear, heart and brilliant mind.\n    Your calm, quiet presence and the solid support is a precious gift.\n     Tom, thank you as well. BNG, thank you for always checking in and being there no matter\n    how crazy busy you are. The unconditional love, goofy antics and\n    support along with your generosity means everything. AJR, as always, eternally grateful for you, your kind heart,\n    sharp legal mind, meals left outside the door, beautiful time\n    consuming and thoughtfully created gifts. I also would like to especially thank who we lovingly and\n    jokingly refer to as our 42-year-old teenager Jojo.  She constantly\n    makes herself available to be with Bob if I’m not. She regularly\n    does grocery runs and has become our garbage fairy (as she leaves\n    she will grab our garbage hauling it to garbage room). Jojo will sit\n    in his room visiting, easily chatting or in silence often doing her\n    crafts as he rests, watches TV or sleeps.  Her gentle, loving,\n    subdued inconspicuous concern and charming ways make his days pass\n    easier. Sandy, your exquisitely blended oils created with love, prayers\n    and healthy blessings continue to benefit Bob, thank you. I must also acknowledge the boys;  for hauling furniture around\n    up and down the building organizing our condo to accommodate Bob’s\n    wheel chair, medical equipment and years of packing boxes of\n    dialysis solution, picking up the slack in all the lil constant\n    things Bob used to do for me at work.  Grateful they all live so\n    close by, able to help whenever I call or just randomly drop by. And\n    to our Spring/Summer imported one, Leo you are always willing to\n    help with a huge grin, thank you. A huge thank you to Courtney and Bey for gifting the indoor\n    electric wheelchair, it’s made your Dad’s life so much easier.\n     Although you both are very busy with careers and kids you make\n    certain to keep in touch. Bey, we are forever grateful for the care,\n    love and support you constantly demonstrate to us, especially Dad. Wayne, Jr., Gibran and Ale, you have been very generous with\n    your loving support, time  and financial assistance these last\n    years, we are grateful. To Brit, your regular upbeat and positive cheerful calls are\n    heartwarming, we acknowledge that these last years have been\n    extremely difficult for you. Adam we are grateful for your support\n    and care in all that you do, especially the late night delivery of\n    oxygen tanks. To both Dan and Bryan, thank you for sitting with him regularly\n    while in the hospital giving me a break and allowing me to run home\n    for a shower.  Bryan, Dan, Edgar and Jack you continue to be there,\n    still making the effort to take Bob out getting together for a meal. WHY FUNDRAZR - DETAILS ON WHY BOB NEEDS HELP Bob receives CPP Disability of $1032 monthly. Together with\n    Fitu’s income, there is a backwards slide every month and credit has\n    been maxed out for a while. Our family Fundrazr campaign is to cover the areas listed\n    below. Please consider donating; all funds raised will be held in a\n    Trust Account set up by a lawyer who’s generously offering her time.\n    All funds will be allocated towards Bob’s medical expenses, recovery\n    and transitions to begin living his “new normal” life.  Any extra\n    funds will be used for getting him some part time assistance as Fitu\n    is working F/T and can’t always be with him. PROSTHETIC LEG - $4,000-$5,000 (balance of $10,000\n    paid by Medical) Bob’s right foot and leg to the knee have already been\n    amputated. Prosthetic leg costs are only partially covered. At this\n    time, funds will only be used for the prosthetic for his right leg.\n    We’re still in the process and will update when we know the exact\n    amount that we’ll need. Fingers crossed that Bob will once again be\n    able to golf, get out on the water again and work around the\n    apartment tower. OUTDOOR ELECTRIC WHEELCHAIR - $5500 Bob will require an outdoor electric wheelchair. The one he has\n    right now is very low power and not designed to go outside. It can’t\n    make it up even a slight incline. Bob will have a lot more mobility\n    and be able to get out and about, go grocery shopping and enjoy the\n    spring with the grandkids. MOVING TO A WHEELCHAIR FRIENDLY APARTMENT - $2400 (Moving Expenses $1200 + Rent Increase $200x 6/mo = $1200). The suite we currently live in is not wheelchair friendly and\n    Bob has extreme difficulty moving about. The doorways are very\n    narrow, he’s unable to ride into bathroom as the door opens in, so\n    he must leave it in the hallway and hop into the bathroom, so far\n    he’s fallen three times trying to negotiate his way in. Our kitchen\n    is difficult for Bob to use, whereas the new one will only have one\n    long bank of cabinets and appliances, not a “U” shape. Bob has always been a great cook and the new kitchen will make\n    it possible for him to make food safely. We will be moving two buildings away to the 4th tower.  We are\n    limited as to where we can live because of my work as an onsite\n    resident managing the building.  The same developer will have an\n    accessible friendly suite ready for us. We will incur moving\n    expenses along with a $200 monthly rent increase to what we\n    currently pay but with the prognosis of extended rehab and the\n    likelihood of another amputation we don’t have much of a choice. MEDICATION - $1100 x 6/ mo = $6600 Bob’s dialysis solution are covered by BC Medical. However, we\n    pay cash for the diabetes and blood pressure medication. A new cost\n    since March is Bob’s Chinese herbal medicines which are specifically\n    for circulation for the leg. He’s noticed an improvement and the\n    medicines will help keep the remaining leg and arms healthy so Bob\n    can continue to live life to the fullest and do the things he loves\n    like cooking for the family and playing with the kids. VAN THAT CAN TRANSPORT THE WHEELCHAIR  - $4320 Bob is in and out of the hospital. Plus there are a ton of\n    doctors appointments. In November, we purchased a new van to\n    transport Bob, wheelchair and dialysis equipment and supplies.\n    Payments are $720/ month. $4320 of raised funds will cover 6 months\n    and take a bit of financial pressure off. The journey to help Bob stabilize and live many more years\n      is ongoing and we’re grateful to all of our family and friends\n      who’ve been there and continue to be. BOB'S MEDICAL HISTORY 2012  July - Diagnosed with Type 2 diabetes and\n    high blood pressure.  At this point all was blood work and symptoms were an indication that Bob was hopeful\n    to control the symptoms with diet and medicine. 2013 Diabetes controlled with medications and diet adjustments as was\n    blood pressure. Losing sensation in feet due to diabetic neuropathy, onset of\n    almost constant nausea accompanied by lack of energy.  Back then I began rating his\n    overall well-being as 3-4 good days followed by 1 bad day. 2014 Diagnosed with the beginning stages of kidney failure, altered\n    diet yet again, this was a struggle to balance a diabetic friendly diet with the renal\n    failure diet. i.e. nuts and cheese recommended for diabetics are not permitted for renal patients. 2015 Followed by his nephrologist, Kidney Clinic and\n  several other health professionals - opthamologist,\n    cardiologist, internal medicine, vascular surgeon etc. 2016 March Began daily Peritoneal Dialysis , 6\n    cycles/exchanges per day.  Improved energy with blood work reflecting stabilizing symptoms with treatment. 2017 Peritoneal Dialysis treatment was causing other issues with\n    peritoneal cavity and organs. Diagnosed with hernias caused by PD and the weight of\n    2000 ml of solution constantly putting pressure on lining and supporting muscles. Oct - Began the process for preparing for a kidney\n    transplant, unfortunately there were ongoing complications and\n    increasing health issues compromising the viability of a transplant.\n     As quickly as our medical system permitted we began addressing each\n    concern only to constantly find another. The diabetes, although well\n    controlled, was slowly and quietly but effectively destroying his\n    eyes, weakening other organs, affecting the mind and circulation.\n    Renal failure causes the destruction of soft muscle tissue, heart,\n    liver, lungs etc. Liver function tests were showing that the enzymes\n    are unhealthy, showing that there were cysts, scar tissue and the\n    beginning of cirrhosis. Bob was told that he’ll eventually require a liver transplant as\n    well but it should not interfere with a kidney transplant.  His\n    heart has 50% blockage in the upper apex the surgeon will wait to\n    insert stents when it is at 70% and appears to be fine aside from\n    the high blood pressure. Since 2016 Bob has been closely followed by an Opthamologist,\n    monthly he would see her, for scans, injections and laser treatments\n    to increase eye health and vision.  She was successful, Bob’s vision\n    is actually pretty good. The prognosis is also positive as for some\n    time he was very fearful and worried that he’d be blind as well. Another prerequisite for Bob’s health to remain on the\n    transplant list is that all of his dental work must be certified by\n    a dentist so as not be a risk for future infection, advised that the\n    most effective and absolute way to ensure that would be to have his\n    remaining teeth extracted and be fitted for dentures. Fortunately\n    with the financial help from Kevin and Carolyn, Bob was able to have\n    this done in November 2018. One more step towards transplant, or as\n    Bob would say, \"one hop at a time\" . 2018 Jan - at this point the side effects of peritoneal\n    dialysis were debilitating and Bob remained bed ridden most of the times. Constant nausea and\n    vomiting for 5 months requiring weekly trips to emergency for IVs to\n    increase fluid in body, extreme weight and muscle mass loss. June - Hemodialysis treatment alleviated the nausea\n    and seemed to overall increase Bob’s energy. July - Final stages of extensive transplant testing\n    the Kidney Transplant team has determined that although I am a\n    match, because Bob has received transfusions he now has antibodies\n    that will not accept my kidney.  We are now included in a program\n    called “Paired Donors” - this program matches a recipient and a\n    donor with another set of participants across Canada, exchanging the\n    available donor kidney. Aug - Tiny cut on right fourth toe eventually\n    presented signs of gangrene, rounds of antibiotics were unsuccessful to cure infection. As the weeks\n    and months passed without sufficient circulation to support the healing the entire toe was\n    affected. Sept - During the 3 times weekly in hospital\n    treatments of hemodialysis Bob regularly contracted infections and suffered with horrible stomach issues. At this point he chose to give PD another try.  Once he switched\n    back to daily home administered peritoneal dialysis, stomach issues\n    and infections no longer an issue.  Prognosis was to Insert stents\n    to hopefully facilitate healing or at the very least to assist the\n    healing of foot once toe was amputated. Oct 9 Admitted to RCH Angioplasty to insert stents in right leg to increase\n    circulation to facilitate healing of toe October amputated toe Nov 6 amputated right leg below knee Now the rush is on to rearrange our condo, purchase all the\n    required mobility equipment to begin our “new normal” lives. Nov 19 discharged from RCH - the healing process at\n    home was slow but fortunately with being followed weekly by RCH’s\n    awesome team at the Wound and Limb preservation clinic and his\n    Vascular Surgeon Bob’s wound healed with only 2 infections. 2019 Left foot -  painful, extremely cold, no circulation discoloured\n    red and no feeling in toes. Testing to determine blood flow and circulation - 50% of October\n    2018 results March - amputation wound sufficiently healed to\n    begin the process to be fitted for a prosthetic leg/foot which will\n    cost $10-12,000.  On the wait list for rehab. March 4 - Chinese Dr. attended Bob at home to\n    diagnose and try to help with lower leg and foot circulation to\n    possibly save it from amputation.  Prescribed a twice daily dose of\n    herbs. March 8 - Vascular Surgeon advises to wait and\n    see, will eventually attempt to insert another stent as a last\n    chance to postpone inevitable lower leg from amputation. March 23 - Wait list to begin training to perform\n    home hemodialysis. April 2 - Continued positive results, less pain\n    while continuing the Chinese Medicines. Thanks again for helping Bob!\n    Please comment, spread the word and help him reach his Fundrazr\n    goal, move to the new apartment and get his new leg. Everything\n    helps and, Bob likes to say,  it's \"one hop at time!\"", "url": ["https://fundrazr.com/HelpSupportBob"]}
]